kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* Vendor streaming application (cleaned: duplicates removed) */
#include <stdint.h>
#include "usbd_cdc_custom.h"
#include "usb_device.h"
#include "usbd_core.h"
#include "usb_vendor_app.h"
#include <string.h>
#include <stdint.h>
#include <stdio.h>
#include <stdarg.h>
#include <math.h>
#include "adc_stream.h"
#include "main.h"
#include <stddef.h> /* offsetof для отладочного вывода */
#include "stm32h7xx_hal.h" /* SCB_* cache maintenance (may HardFault if MPU/cache config incomplete) */
/* Для дублирования фрагментов кадров в CDC (Virtual COM) */
#include "usbd_cdc_if.h"
#include "usbd_cdc_custom.h" /* для USBD_VND_RequestSoftReset/DeepReset (объявления находятся в .c) */
#include "vnd_testgen.h"

/* === DC калибровка (только для stream_mode=2 / AVG_ROI) ===
   Требование:
   - DC буферы 200 семплов для каждого (канал A/B) × (even/odd)
   - Вычитание DC из усреднённых данных
   - Адаптация DC: за каждый усреднённый пакет обновляем ровно 1 семпл на +/-1
   - Гейт: если на полном сыром буфере (обычно 600 семплов) нет (max-min)>60000,
       то DC вычитание и адаптация отключены.
   - Сохранение в Flash примерно каждые 10–20 минут.
*/
#include "stm32h7xx_hal_flash.h"
#include "stm32h7xx_hal_flash_ex.h"

/* В этом проекте операции invalidate/clean DCache могут вызывать HardFault
    (см. комментарий в adc_stream.c). Поэтому по умолчанию отключаем их.
    Если позже будет настроена некэшируемая память/MPU корректно — можно включить. */
#ifndef VND_ENABLE_CACHE_INVALIDATE
#define VND_ENABLE_CACHE_INVALIDATE 0
#endif

/* Forward declaration (реализация ниже) для предотвращения implicit-function-warning при раннем вызове */
void vnd_diag_log_possible_stall(void);
static void cdc_logf(const char *fmt, ...);

/* Управление дублированием данных кадров в CDC (COM-порт):
 *  0 — отключено (оставляем только события START/STOP и 1 Гц статистику)
 *  1 — включено (превью первых 64 сэмплов раз в ≤10 Гц)
 */
#ifndef VND_CDC_PREVIEW_ENABLE
#define VND_CDC_PREVIEW_ENABLE 0
#endif

#ifndef VND_DIAG_BUFFER_ID_MODE
#define VND_DIAG_BUFFER_ID_MODE 1  /* Режим отладки: использовать ID буфера вместо seq */
#endif

#ifndef VND_ENABLE_LOG
#define VND_ENABLE_LOG 0 /* ОТКЛЮЧЕНО: логи засоряют терминал */
#endif
#if VND_ENABLE_LOG
#define VND_LOG(...) do { printf("[VND] " __VA_ARGS__); printf("\r\n"); } while(0)
#else
#define VND_LOG(...) do{}while(0)
#endif

extern USBD_HandleTypeDef hUsbDeviceHS;

/* В диагностическом режиме упростим логику: отправлять только A-кадр (без обязательного B).
    Это помогает подтвердить транспорт USB IN и исключает потенциальные блокировки на pending_B. */
#ifndef VND_DIAG_SEND_A_ONLY
#define VND_DIAG_SEND_A_ONLY 0
#endif

/* Полностью отключить тестовые кадры (TEST) и связанную с ними
    стартовую/keepalive логику, чтобы исключить гонки и зависания EP
    на некоторых хостах. При включении — начинаем сразу с A/B. */
#ifndef VND_DISABLE_TEST
#define VND_DISABLE_TEST 1
#endif

/* Команды */
#define VND_CMD_START_STREAM   0x20u
#define VND_CMD_STOP_STREAM    0x21u
#define VND_CMD_DEVICE_RESET   0x22u  /* ПОЛНЫЙ RESET MCU (для отладки) */
#define VND_CMD_GET_STATUS     0x30u
/* Диагностический статус: отправить STAT немедленно даже при pending_B (для отладки зависаний) */
#define VND_CMD_GET_STATUS_IMM 0x31u
/* Отладка фаз/буферов: инверсия тестового выхода PA2 (TIM2_CH3) */
#define VND_CMD_TOGGLE_TIM2CH3_INV 0x32u
/* ДОБАВЛЕНО: управление окнами/частотой */
#define VND_CMD_SET_WINDOWS    0x10u /* payload: start0,len0,start1,len1 (LE, u16) */
#define VND_CMD_SET_BUF_RATE_FINE 0x1Cu /* payload: marker_hz (<=350) или buf_rate_hz (>350), fine 180-250 Hz */
#define VND_CMD_SET_BLOCK_HZ   0x11u /* payload: u16 hz (20..100) или 0xFFFF=макс (100) */
/* Новая команда: установка ограничения числа выборок на канал в рабочем кадре */
#define VND_CMD_SET_TRUNC_SAMPLES 0x16u /* payload: u16 samples (0=отключить усечение) */
/* Новая команда: явная установка samples_per_frame для управления FPS (пара A+B ≈ Fs/samples) */
#define VND_CMD_SET_FRAME_SAMPLES 0x17u /* payload: u16 samples_per_frame (на канал) */
/* Новый режим: асинхронная передача A/B — без строгого чередования A→B; какой готов, тот и уходит */
#define VND_CMD_SET_ASYNC_MODE   0x18u /* payload: u8 mode (0=pairing/strict A->B, 1=async A/B independent) */
/* Новый режим выбора каналов: 0=A-only, 1=B-only, 2=both */
#define VND_CMD_SET_CHMODE       0x19u /* payload: u8 mode (0=A-only, 1=B-only, 2=both) */

/* Режимы стриминга (поведение выбора кадров/окна)
     SET_STREAM_MODE payload:
         - [1] u8 mode: 0=LATEST (lossy), 1=LOSSLESS_ROI, 2=AVG_ROI
         - [2] u8 avg_n (опционально, только для mode=2): 1..32, default=20
*/
#define VND_CMD_SET_STREAM_MODE  0x1Au
/* DC Adaptation control: 0x00=freeze (stop learning), 0x01=active (resume learning) */
#define VND_CMD_SET_DC_ADAPT     0x1Bu
#define VND_STREAM_MODE_LATEST        0u
#define VND_STREAM_MODE_LOSSLESS_ROI  1u
#define VND_STREAM_MODE_AVG_ROI       2u
#define VND_AVG_MAX_N                 64u  /* Максимум 64 буфера для усреднения (шаг 8: 8/16/24/32/40/48/56/64) */
#define VND_AVG_OUT_Q                 4u

/* Параметры */
#define VND_DEFAULT_TEST_SAMPLES   80u
#define VND_DEBUG_FORCE_STAT_INTERVAL_MS 200u // было 100
#define VND_DEBUG_RAW_STAT_INTERVAL_MS   100u

/* ---------------- Глобальные переменные состояния (централизовано) ---------------- */
/* Видимая снаружи (CDC) метка стриминга */
volatile uint8_t streaming = 0;
/* Последовательность пар (инкремент только после успешного завершения B) */
volatile uint32_t stream_seq = 0;
/* Фактически зафиксированный размер кадров и ожидаемый размер байт */
volatile uint16_t cur_samples_per_frame = 0;
volatile uint16_t cur_expected_frame_size = 0;
/* Служебные отметки старта/ошибок */
volatile uint32_t start_cmd_ms = 0;
volatile uint32_t vnd_last_error = 0;
/* Отложенный (main-loop) перезапуск ADC/DMA по команде START.
    Важно: USBD_VND_DataReceived может вызываться из USB IRQ, поэтому тяжёлые действия
    (останов/запуск DMA, cache maintenance) выполняем в Vendor_Stream_Task(). */
static volatile uint8_t vnd_adc_restart_request = 0;
/* Флаги канала передачи */
static volatile uint8_t  vnd_ep_busy = 0;     /* EP IN занят */
static volatile uint8_t  vnd_inflight = 0;    /* есть незавершённая передача */
/* Тестовый кадр (разрешён один раз на START, для keepalive) */
static volatile uint8_t  test_sent = 0;
static volatile uint8_t  test_in_flight = 0;
/* Отладочные счётчики/статусы */
volatile uint32_t dbg_produced_seq = 0;
volatile uint32_t dbg_sent_seq_adc0 = 0;
volatile uint32_t dbg_sent_seq_adc1 = 0;
volatile uint32_t dbg_partial_frame_abort = 0;
volatile uint32_t dbg_size_mismatch = 0;
volatile uint32_t dbg_resend_blocked = 0;
/* (Определения vnd_diag_prepare_pair и vnd_diag_try_tx перенесены ниже, после объявлений типов/буферов) */
static volatile uint32_t dbg_tx_attempt = 0;
static volatile uint32_t dbg_tx_reject = 0;
static volatile uint32_t dbg_tx_sent = 0;
static volatile uint32_t dbg_status_sent = 0;
volatile uint32_t dbg_sent_ch0_total = 0; // новые счётчики по каналам
volatile uint32_t dbg_sent_ch1_total = 0;
/* Глобальный счётчик завершений передачи (используется в статусе и диагностике) */
volatile uint32_t dbg_tx_cplt = 0;
/* Следующая метка последовательности для назначения готовящимся парам (может опережать stream_seq,
   который инкрементируется только по завершении B). */
static volatile uint32_t next_seq_to_assign = 0;

