kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* Deadband для адаптации DC вокруг midscale.
    Без deadband даже при правильном DC из-за шума знак (v-32767) будет часто меняться,
    что приводит к "random walk" (постоянно dirty и ощущение, что после reboot всё заново).
    Значение в LSB. */
#ifndef VND_DC_DEADBAND
#define VND_DC_DEADBAND 16u
#endif

/* ВНИМАНИЕ: адрес Flash должен быть вне области прошивки.
   Мы резервируем последний сектор через линкер (см. STM32H723VGTX_FLASH.ld).
   Для 1MB FLASH: база последнего сектора = 0x080E0000 (128KB сектор №7). */
#ifndef VND_DC_FLASH_ADDR
#define VND_DC_FLASH_ADDR 0x080E0000u
#endif

#define VND_DC_MAGIC 0x31434456u /* 'V''D''C''1' little-endian */
/* ver=2: dc[] стало int16_t (signed offsets), совместимость с ver=1 не поддерживаем */
#define VND_DC_VER   2u

typedef struct __attribute__((packed)) {
    uint32_t magic;
    uint16_t ver;
    uint16_t roi_len; /* ожидаем 200 */
    uint32_t write_counter;
    uint16_t crc16; /* CRC16-CCITT по полю data[] */
    uint16_t _rsv0;

    int16_t  dc[2][2][VND_DC_ROI_LEN]; /* [ch][parity][i] signed offset */
    uint8_t  pos[2][2];
    uint8_t  _pad[32]; /* запас/выравнивание; точный размер не критичен */
} vnd_dc_blob_t;

/* Flash layout: append-only journal inside the reserved 128KB sector.
   This avoids long sector erase on every save (which can stall USB/main loop).
   We erase the sector only when it becomes full or journal tail is corrupted.
   Slot size must be multiple of 32 bytes for FLASHWORD programming. */
#define VND_DC_FLASH_SECTOR_SIZE (0x20000u)
#define VND_DC_SLOT_SIZE         (((uint32_t)sizeof(vnd_dc_blob_t) + 31u) & ~31u)

static int16_t  vnd_dc_buf[2][2][VND_DC_ROI_LEN];
static uint8_t  vnd_dc_pos[2][2];
static uint8_t  vnd_dc_loaded = 0;
static uint8_t  vnd_dc_dirty = 0;
static uint32_t vnd_dc_write_counter = 0;
static uint32_t vnd_dc_flash_next_off = 0;
static uint32_t vnd_dc_last_save_ms = 0;
static uint32_t vnd_dc_last_dirty_log_ms = 0;
static volatile uint8_t vnd_dc_load_request = 0;

/* После reboot "чет/нечет" (parity) может оказаться инвертирован относительно того, что было
    во время обучения/сохранения (из-за фазировки старта DMA/TIM).
    Мы НЕ смешиваем 4 DC массива, а один раз на старте определяем swap (0/1) и дальше
    используем parity^swap при применении/адаптации. */
static uint8_t vnd_dc_parity_swap = 0;
static uint8_t vnd_dc_parity_swap_valid = 0;

static void vnd_dc_load_once(void);
static void vnd_dc_apply_and_adapt(uint8_t ch, uint8_t parity, uint16_t *out, uint16_t roi_len, uint8_t gate_enabled);

/* Exported counters for LCD/diagnostics (see usb_vendor_app.h) */
volatile uint32_t vnd_dc_save_ok_count = 0;
volatile uint32_t vnd_dc_save_fail_count = 0;
volatile uint32_t vnd_dc_save_last_ms = 0;
volatile uint8_t  vnd_dc_save_last_result = 0; /* 0=none, 1=ok, 2=fail */

/* DC Adaptation control (can be frozen by host during signal detection) */
volatile uint8_t  vnd_dc_adapt_enabled = 1; /* 1=active (learning), 0=freeze (keep current values) */

/* Public mirror of blob write_counter for LCD/debug (see usb_vendor_app.h) */
volatile uint32_t vnd_dc_write_counter_public = 0;

/* Exported live state for LCD progress indicator */
volatile uint8_t  vnd_dc_dirty_public = 0;
volatile uint32_t vnd_dc_dirty_since_ms = 0;
volatile uint32_t vnd_dc_save_period_ms = (uint32_t)VND_DC_SAVE_PERIOD_MS;

/* DC save diagnostics */
volatile uint32_t vnd_dc_save_last_err = 0;
volatile uint32_t vnd_dc_save_last_sector_error = 0;
volatile uint32_t vnd_dc_save_last_bank = 0;
volatile uint32_t vnd_dc_save_last_sector = 0;

/* DC load diagnostics (published for LCD) */
volatile uint8_t  vnd_dc_load_flags_public = 0; /* bit0=loaded OK, bit1=erase_pending */
volatile uint16_t vnd_dc_loaded_crc16_public = 0;
volatile uint32_t vnd_dc_flash_next_off_public = 0;

static uint32_t vnd_dc_adapt_block_until_ms = 0;

/* Гейт DC для текущей группы усреднения (решение принимается по полному сырому буферу до 600 семплов).
    1 = DC включён (если на полном буфере есть полный размах > threshold), 0 = DC выключен. */
/* DC gate больше не привязан к stream_mode: он вычисляется в фоне по сырому буферу (mx-mn).
    stream_mode влияет только на то, что отправляется по USB. */

static uint16_t vnd_crc16_ccitt(const uint8_t *data, uint32_t len); /* объявлена ниже в файле */

static uint16_t vnd_dc_bank_crc16(uint8_t ch, uint8_t parity)
{
    if(ch > 1u || parity > 1u) return 0;
    return vnd_crc16_ccitt((const uint8_t*)vnd_dc_buf[ch][parity], (uint32_t)sizeof(vnd_dc_buf[ch][parity]));
}

static uint32_t vnd_dc_score_bank(const uint16_t *raw, uint16_t raw_ns, uint16_t roi_start, uint16_t roi_len, uint8_t ch, uint8_t parity)
{
    if(!raw) return 0xFFFFFFFFu;
    if(ch > 1u || parity > 1u) return 0xFFFFFFFFu;
    if(roi_len != (uint16_t)VND_DC_ROI_LEN) return 0xFFFFFFFFu;
    if(raw_ns < (uint16_t)(roi_start + roi_len)) return 0xFFFFFFFFu;

    /* Скоринг: весь ROI (200 точек). Это выполняется редко (один раз после reboot),
       поэтому лучше быть надёжным, чем быстрым. */
    uint32_t acc = 0;
    for(uint16_t i = 0; i < roi_len; i++){
        uint16_t v = raw[roi_start + i];
        int16_t dc = vnd_dc_buf[ch][parity][i];
        int32_t y = (int32_t)v + (int32_t)dc;
        int32_t e = y - 32767;
        if(e < 0) e = -e;
        acc += (uint32_t)e;
    }
    return acc;
}

static inline void vnd_invalidate_dcache_range(uint32_t addr, uint32_t len)
{
#if (VND_ENABLE_CACHE_INVALIDATE && (__DCACHE_PRESENT == 1U))
    if(len == 0u) return;
    uint32_t a0 = addr & ~31u;
    uint32_t a1 = (addr + len + 31u) & ~31u;
    uint32_t alen = a1 - a0;
    SCB_InvalidateDCache_by_Addr((uint32_t*)a0, (int32_t)alen);
#else
    (void)addr; (void)len;
#endif
}

static inline uint8_t vnd_raw_has_full_swing_u16(const uint16_t *p, uint16_t n, uint32_t threshold)
{
    if(!p || n == 0u) return 0u;
    uint16_t mn = 0xFFFFu;
    uint16_t mx = 0u;

    uint16_t step = (uint16_t)VND_DC_RANGE_STRIDE;
    if(step == 0u) step = 1u;

    for(uint16_t i=0;i<n;i=(uint16_t)(i+step)){
        uint16_t v = p[i];
        if(v < mn) mn = v;
        if(v > mx) mx = v;
        if((uint32_t)(mx - mn) > threshold) return 1u; /* экономим CPU: дальше не проверяем */
    }
    return 0u;
}

