kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* === Профилирование производительности === */
typedef struct {
    uint32_t prepare_total_us;    /* Суммарное время подготовки пар (мкс) */
    uint32_t prepare_count;       /* Кол-во вызовов prepare */
    uint32_t transmit_total_us;   /* Суммарное время transmit (мкс) */
    uint32_t transmit_count;      /* Кол-во вызовов transmit */
    uint32_t txcplt_total_us;     /* Суммарное время TxCplt (мкс) */
    uint32_t txcplt_count;        /* Кол-во вызовов TxCplt */
    uint32_t last_pair_complete_ms; /* Время последнего завершения пары */
    uint32_t min_pair_interval_ms;  /* Минимальный интервал между парами */
    uint32_t max_pair_interval_ms;  /* Максимальный интервал между парами */
} perf_stats_t;

static perf_stats_t perf_stats = {0};

/* Вспомогательная функция для получения времени в микросекундах (используем HAL_GetTick с умножением) */
static inline uint32_t get_us_approx(void) {
    /* Приблизительно: 1 мс = 1000 мкс. Для более точного измерения нужен DWT, 
       но HAL_GetTick безопаснее и достаточно точен для наших целей */
    static uint32_t last_tick = 0;
    static uint32_t us_offset = 0;
    uint32_t tick = HAL_GetTick();
    if(tick != last_tick){
        us_offset = 0;
        last_tick = tick;
    }
    return tick * 1000 + us_offset++;
}

/* Инвалидация D-Cache для DMA-буфера (копия функции из adc_stream.c) */
static inline void vnd_invalidate_cache_for_buffer(void *buf, uint32_t samples)
{
#if (VND_ENABLE_CACHE_INVALIDATE && defined (SCB_InvalidateDCache_by_Addr))
    uintptr_t addr = (uintptr_t)buf;
    uintptr_t start = addr & ~(uintptr_t)31u; /* выравнивание вниз до 32 байт */
    uint32_t bytes = samples * (uint32_t)sizeof(uint16_t);
    uint32_t extra = (uint32_t)(addr - start);
    uint32_t total = bytes + extra;
    uint32_t total_aligned = (total + 31u) & ~31u; /* кратность 32 */
    SCB_InvalidateDCache_by_Addr((uint32_t*)start, (int32_t)total_aligned);
#else
    (void)buf; (void)samples;
#endif
}

/* Быстрый санитайзер: заменяет явно повреждённые (>12 бит) значения последним валидным */
static __attribute__((unused)) uint32_t vnd_sanitize_samples(uint16_t *buf, uint16_t samples, const char *tag)
{
    uint32_t fixed = 0;
    uint16_t prev = 0;
    uint8_t have_prev = 0;
    uint16_t first_bad = 0, first_idx = 0;
    for(uint16_t i = 0; i < samples; ++i){
        uint16_t v = buf[i];
        if(v > 4095u){
            if(fixed == 0){ first_bad = v; first_idx = i; }
            buf[i] = have_prev ? prev : 0;
            fixed++;
        } else {
            prev = v; have_prev = 1;
        }
    }
    if(fixed){
        static uint32_t last_log_ms = 0;
        uint32_t now = HAL_GetTick();
        if(now - last_log_ms >= 1000u){
            last_log_ms = now;
            printf("[VND_SAN] %s fixed=%lu first_idx=%u first_bad=%u prev=%u\r\n",
                   tag, (unsigned long)fixed, (unsigned)first_idx, (unsigned)first_bad, (unsigned)(have_prev ? prev : 0));
        }
    }
    return fixed;
}
/* Подсчёт выбросов >4095 (опционально, если включить санитайзер) */
static volatile uint32_t dbg_gt4095_ch[2] = {0,0};
#ifndef VND_ENABLE_ADC_SANITIZE
#define VND_ENABLE_ADC_SANITIZE 0 /* по умолчанию не трогаем данные ADC */
#endif

#ifndef VND_SPIKE_CLIP_ENABLE
#define VND_SPIKE_CLIP_ENABLE 0 /* теперь не клипуем, только детектируем */
#endif
#ifndef VND_SPIKE_THRESHOLD
#define VND_SPIKE_THRESHOLD 3000u
#endif
#ifndef VND_SPIKE_MIN_LEN
#define VND_SPIKE_MIN_LEN 6u
#endif

/* Детектор/клиппер блоков высокой амплитуды (короткие пачки ≈10 семплов) */
static __attribute__((unused)) uint32_t vnd_detect_and_clip_spikes(uint16_t *buf, uint16_t samples, const char *tag)
{
    if(!buf || samples == 0) return 0;
    uint32_t events = 0;
    uint16_t thr = VND_SPIKE_THRESHOLD;
    uint16_t last_good = 0;
    uint8_t have_last = 0;
    static uint32_t last_log_ms = 0;
    for(uint16_t i=0; i<samples; ){
        uint16_t v = buf[i];
        if(v <= thr){
            last_good = v; have_last = 1; i++; continue;
        }
        /* найден старт блока выше порога */
        uint16_t start = i;
        uint16_t maxv = v;
        while(i < samples && buf[i] > thr){
            if(buf[i] > maxv) maxv = buf[i];
            i++;
        }
        uint16_t len = (uint16_t)(i - start);
        if(len >= VND_SPIKE_MIN_LEN){
            events++;
            /* опционально клипуем весь блок на последнее валидное значение */
            if(VND_SPIKE_CLIP_ENABLE){
                uint16_t fill = have_last ? last_good : 0;
                for(uint16_t k=start; k<start+len && k<samples; ++k){ buf[k] = fill; }
            }
            uint32_t now = HAL_GetTick();
            if(now - last_log_ms >= 500u){
                last_log_ms = now;
                printf("[VND_SPIKE] %s idx=%u len=%u max=%u thr=%u clip=%u\r\n",
                       tag, (unsigned)start, (unsigned)len, (unsigned)maxv,
                       (unsigned)thr, (unsigned)VND_SPIKE_CLIP_ENABLE);
            }
        }
    }
    return events;
}

typedef struct {
    uint16_t idx;
    uint16_t len;
    uint16_t maxv;
    uint8_t  ch;
} spike_info_t;

static __attribute__((unused)) void vnd_log_spike_window(const spike_info_t *si, const uint16_t *buf, uint16_t samples, uint32_t seq)
{
    if(!si || !buf) return;
    uint16_t start = si->idx;
    uint16_t end = (uint16_t)(start + si->len);
    uint16_t w0 = (start > 8) ? (uint16_t)(start - 8) : 0;
    uint16_t w1 = end + 8; if(w1 > samples) w1 = samples;
    /* Логируем только до 16 значений, чтобы не шуметь CDC */
    char line[256];
    int pos = snprintf(line, sizeof(line), "[SPIKE_DUMP] CH=%c seq=%lu idx=%u len=%u max=%u win=%u..%u vals=",
                       si->ch ? 'B' : 'A', (unsigned long)seq, (unsigned)si->idx, (unsigned)si->len, (unsigned)si->maxv,
                       (unsigned)w0, (unsigned)w1);
    uint16_t printed = 0;
    for(uint16_t i = w0; i < w1 && pos < (int)sizeof(line)-8; ++i){
        pos += snprintf(line+pos, sizeof(line)-pos, "%u,", (unsigned)buf[i]);
        if(++printed >= 16) break;
    }
    if(pos > 0 && pos < (int)sizeof(line)) line[pos-1] = 0; /* убрать последнюю запятую */
    cdc_logf("%s", line);
}

static __attribute__((unused)) uint8_t vnd_detect_spike_info(uint16_t *buf, uint16_t samples, uint16_t thr, uint16_t min_len, uint8_t ch, spike_info_t *out)
{
    if(!buf || samples < min_len || !out) return 0;
    for(uint16_t i=0; i<samples; ){
        uint16_t v = buf[i];
        if(v <= thr){ i++; continue; }
        uint16_t start = i;
        uint16_t maxv = v;
        while(i < samples && buf[i] > thr){ if(buf[i] > maxv) maxv = buf[i]; i++; }
        uint16_t len = i - start;
        if(len >= min_len){
            out->idx = start; out->len = len; out->maxv = maxv; out->ch = ch;
            return 1;
        }
    }
    return 0;
}

/* Локальная утилита: обновить LCD параметрами, присланными хостом */
/* ДИАГНОСТИКА: обновление индикации последней принятой команды на LCD и UART */
static void vnd_update_cmd_indicator(void)
{
    char cmd_str[16];
    uint32_t now = HAL_GetTick();
    uint32_t elapsed_sec = (now >= last_cmd_timestamp_ms) ? ((now - last_cmd_timestamp_ms) / 1000) : 0;
    
    /* Компактный формат для размещения после "USB:CFG" на верхней строке LCD:
       Показываем последнюю команду и сколько секунд назад она была получена */
    if (last_cmd_received == 0x20) {
        snprintf(cmd_str, sizeof(cmd_str), "ST:%lu", (unsigned long)cmd_start_count);
    } else if (last_cmd_received == 0x21) {
        snprintf(cmd_str, sizeof(cmd_str), "SP:%lu", (unsigned long)cmd_stop_count);
    } else {
        snprintf(cmd_str, sizeof(cmd_str), "--:0");
    }
    
    /* Вывод на LCD строка 0 (y=0), позиция x=80 пикселей (между USB:CFG и T2:) */
    LCD_ShowString_Size(80, 0, cmd_str, 16, YELLOW, BLACK);
    
