kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
            /* seq в заголовке делаем непрерывным (по stream_seq), а dma_seq кладём в reserved */
            pair_seq = stream_seq;
            used_avg_ts_ms = vnd_avg_q_ts_ms[used_avg_q_idx];
            crc_seq = vnd_avg_q_dma_seq[used_avg_q_idx]; /* временно переносим out_dma_seq */

            /* Указатели на усреднённые данные */
            ch1 = vnd_avg_q_out[used_avg_q_idx][0];
            ch2 = vnd_avg_q_out[used_avg_q_idx][1];
            samples = roi_len;
            crc_a = 0;
        }
    }
    else
    {
        /* ПОЛИТИКА last-buffer-wins: выбираем САМЫЙ ПОСЛЕДНИЙ полный кадр и пропускаем старые.
            Это повышает визуальную частоту при ограниченной пропускной способности USB. */
        // Читаем s_next_ring_index и отслеживаем изменения
        extern volatile uint32_t s_next_ring_index;
        static uint32_t last_current = 0xFFFFFFFF;
        static uint32_t local_seq = 0;
        
        __disable_irq();
        uint32_t current = s_next_ring_index;
        __enable_irq();
        
        // Отправляем данные ТОЛЬКО когда s_next_ring_index изменился
        if (current != last_current) {
            last_current = current;
            local_seq++;  // Инкрементируем счётчик кадров
        } else {
            return;  // Нет новых данных - пропускаем
        }
        
        // Вычисляем индекс последнего заполненного буфера
        uint32_t idx = (current + FIFO_FRAMES - 1) & (FIFO_FRAMES - 1);
        
        if (idx >= FIFO_FRAMES) return;
        
        pair_seq = local_seq;
        #if ADC_USB_STAGE_ENABLE
        __disable_irq();
        stage_samples = adc_stream_get_active_samples();
        if(stage_samples > MAX_FRAME_SAMPLES) stage_samples = MAX_FRAME_SAMPLES;
        memcpy(stage_copy, usb_stage_bufA, stage_samples * sizeof(uint16_t));
        crc_a = adc_stage_crc_a; crc_seq = adc_stage_crc_seq;
        __enable_irq();
        ch1 = stage_copy;
        #else
        // D-cache отключен глобально - можем читать напрямую
        ch1 = adc1_buffers[idx];
        #endif
        ch2 = adc2_buffers[idx];
        /* Используем актуальное значение семплов активного профиля */
        samples = adc_stream_get_active_samples();
    }
#endif
    if(samples == 0){
        /* Нет новых данных от АЦП — ничего не отправляем */
        return;
    }
    /* Выбор целевого размера кадра: профиль ADC с учётом ограничений от хоста */
    uint16_t profile_ns = adc_stream_get_active_samples();
    uint16_t target_ns = profile_ns;
    if(vnd_frame_samples_req && vnd_frame_samples_req < target_ns) target_ns = vnd_frame_samples_req;
    if(vnd_trunc_samples && vnd_trunc_samples < target_ns) target_ns = vnd_trunc_samples;
    if(target_ns > VND_MAX_SAMPLES) target_ns = VND_MAX_SAMPLES;
    /* Фиксируем формат только на target_ns. Никогда не локаемся на меньшем значении. */
    if(cur_samples_per_frame == 0){
        /* Если данных текущего кадра меньше чем target_ns, подождём следующую итерацию. */
        if(samples < target_ns){
            VND_LOG("WAIT_FULL: have=%u need=%u (profile=%u)", samples, target_ns, profile_ns);
            return;
        }
        cur_samples_per_frame = target_ns;
        cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame * 2u);
        VND_LOG("SIZE_LOCK %u (raw=%u req=%u trunc=%u)", cur_samples_per_frame, samples, vnd_frame_samples_req, vnd_trunc_samples);
        cdc_logf("SIZE_LOCK raw=%u req=%u trunc=%u -> lock=%u", samples, vnd_frame_samples_req, vnd_trunc_samples, cur_samples_per_frame);
    }
    /* После фиксации не отправляем неполные кадры */
    if(samples < cur_samples_per_frame){
        VND_LOG("SKIP_PARTIAL: have=%u locked=%u", samples, cur_samples_per_frame);
        dbg_partial_frame_abort++;
        return;
    }
    ChanFrame *f0 = &g_frames[active_slot][0];
    ChanFrame *f1 = &g_frames[active_slot][1];
    /* Если пара уже подготовлена (оба READY или SENDING), не переписываем */
    if((f0->st == FB_READY || f0->st == FB_SENDING) && (f1->st == FB_READY || f1->st == FB_SENDING)) return;
    /* Сбросим оба кадра в начальное состояние для заполнения */
    memset(f0->buf, 0, sizeof(f0->buf)); memset(f1->buf, 0, sizeof(f1->buf));
    f0->crc16 = f1->crc16 = 0; f0->crc_seq = f1->crc_seq = 0;
    if(crc_a){ f0->crc16 = crc_a; f0->crc_seq = crc_seq; }
    uint32_t pair_timestamp = HAL_GetTick();
    if(vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
          /* В режиме усреднения crc_seq временно хранит out_dma_seq.
              timestamp берём из очереди готового результата (used_avg_ts_ms), если доступен. */
          if(used_avg_ts_ms != 0){ pair_timestamp = used_avg_ts_ms; }
    }
    /* подробный лог пары убран для снижения нагрузки */
    /* Применяем усечение, если задано и меньше доступного */
    uint16_t use_samples = cur_samples_per_frame; /* уже определено и проверено */
    uint16_t stamp_idx = 0, stamp_seq16 = 0; /* диагностические метки в payload */
    (void)stamp_idx; (void)stamp_seq16;

    /* В режиме AVG_ROI (stream_mode=2) DC уже применяется внутри vnd_avg_drain_fifo() перед постановкой в очередь.
       Здесь используем данные как есть, чтобы избежать двойного вычитания DC. */
    const uint16_t *src_a = ch1;
    const uint16_t *src_b = ch2;

    for(uint16_t i = 0; i < use_samples; i++){
#if USE_TEST_SAWTOOTH
        /* Полный тестовый режим (путь был основной ранее, оставлен для совместимости). */
        uint16_t a = (uint16_t)(i + 1);
        uint16_t b = (uint16_t)(i + 1);
#else
    #if TEST_OVERLAY_SAWTOOTH
        /* Мягкая подмена: сохраняем ADC/DMA и async, но данные делаем детерминированной пилой. */
        uint16_t a = (uint16_t)(i + 1);
        uint16_t b = (uint16_t)(i + 1);
    #else
        uint16_t a = src_a[i];
        uint16_t b = src_b[i];
    #endif
#endif
        uint8_t *p0 = f0->buf + VND_FRAME_HDR_SIZE + 2 * i; p0[0] = (uint8_t)(a & 0xFF); p0[1] = (uint8_t)(a >> 8);
        uint8_t *p1 = f1->buf + VND_FRAME_HDR_SIZE + 2 * i; p1[0] = (uint8_t)(b & 0xFF); p1[1] = (uint8_t)(b >> 8);
    }
    f0->samples = f1->samples = use_samples; 
    /* Сохраняем индекс DMA (seq/rd) для привязки отображения на хосте.
       В stream_mode=2 header.seq идёт как stream_seq, а dma_seq берём из последнего кадра группы (передан через crc_seq). */
    if(vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        uint32_t out_dma_seq = crc_seq;
        f0->dma_seq = f1->dma_seq = out_dma_seq;
        /* crc_seq больше не нужен как временный канал */
        crc_seq = 0;
    } else {
        f0->dma_seq = f1->dma_seq = pair_seq;
    }
    /* CRC для контроля целостности.
       В ROI режиме считаем CRC всегда по фактическому payload (staging CRC относится к полному кадру). */
    if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        f0->crc16 = vnd_crc16_ccitt(f0->buf + VND_FRAME_HDR_SIZE, (uint32_t)use_samples * 2u);
        f0->crc_seq = pair_seq;
    } else {
        #if !ADC_USB_STAGE_ENABLE
        f0->crc16 = vnd_crc16_ccitt(f0->buf + VND_FRAME_HDR_SIZE, (uint32_t)use_samples * 2u);
        f0->crc_seq = frame_rd_seq; /* ближайшее доступное значение */
        #endif
    }
    f1->crc16 = vnd_crc16_ccitt(f1->buf + VND_FRAME_HDR_SIZE, (uint32_t)use_samples * 2u);
    f1->crc_seq = f0->crc_seq;
    /* seq в заголовке привязан к последовательности DMA (pair_seq), одинаковый для A и B */
    f0->seq = pair_seq;
    f1->seq = pair_seq;
    vnd_frame_hdr_t *h0 = (vnd_frame_hdr_t*)f0->buf; h0->timestamp = pair_timestamp;
    vnd_frame_hdr_t *h1 = (vnd_frame_hdr_t*)f1->buf; h1->timestamp = pair_timestamp;
    vnd_build_frame(f0); vnd_build_frame(f1);

     /* ВАЖНО: reserved2 на хосте используется как buffer_index (0-7).
         Для AVG_ROI нельзя вычислять это значение позже по dma_seq (кольцевой s_buffer_parity перезаписывается),
         поэтому берём сохранённую метку из очереди. */
     uint16_t buf_idx = 0;
     if(used_avg_q){
         buf_idx = (uint16_t)(vnd_avg_q_bufidx[used_avg_q_idx] & 0x07u);
     } else {
         buf_idx = (uint16_t)(adc_get_buffer_parity(f0->dma_seq) & 0x07u);
     }
     h0->reserved2 = buf_idx;
     h1->reserved2 = buf_idx;
    if(f0->st == FB_FILL || f1->st == FB_FILL){ dbg_partial_frame_abort++; VND_LOG("build failed"); return; }

