kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* Для stream_mode=2: только после успешной подготовки выталкиваем элемент из очереди */
    if(used_avg_q && vnd_avg_q_count){
        vnd_avg_q_head = (uint8_t)((vnd_avg_q_head + 1u) % VND_AVG_OUT_Q);
        vnd_avg_q_count--;
        dbg_avg_tx_pairs++;
    }
    /* Продвигаем индекс заполнения, если кадр успешно подготовлен */
    pair_fill_idx = (uint8_t)((active_slot + 1u) % VND_PAIR_BUFFERS);
    dbg_prepare_ok++;
    /* FPS: счётчик подготовленных пар */
    fps_prepare_count++;
    
    /* Измерение времени prepare */
    uint32_t t_end = get_us_approx();
    uint32_t duration = t_end - t_start;
    perf_stats.prepare_total_us += duration;
    perf_stats.prepare_count++;
}

static void vnd_build_frame(ChanFrame *cf)
{
    if(cf->samples == 0){ cf->st = FB_FILL; return; }
    uint32_t payload_len = (uint32_t)cf->samples * 2u;
    uint32_t total = VND_FRAME_HDR_SIZE + payload_len;
    vnd_frame_hdr_t *h = (vnd_frame_hdr_t*)cf->buf;
    
    h->magic = 0xA55A;
    h->ver = 0x01;
    h->flags = (cf->flags & VND_FLAGS_ADC0) ? 0x01 : 0x02;
    h->seq = cf->seq;
    h->total_samples = (uint16_t)cf->samples;

    /* Метаданные ROI для хоста:
       - В режиме LOSSLESS_ROI передаём только окно [win_start0 : win_start0+samples)
       - total_samples = samples (обычно 200)
       - zone1_offset/zone1_length позволяют хосту рисовать ось X как 280..479, а не 0..199
    */
    if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        h->zone_count = 1;
        h->zone1_offset = (uint32_t)win_start0;
        h->zone1_length = (uint32_t)cf->samples;
    } else {
        h->zone_count = 0;
        h->zone1_offset = 0;
        h->zone1_length = 0;
    }
    h->reserved = cf->dma_seq;
    
     /* reserved2: buffer_index (0-7) для GUI. Даже/нечёт можно получить как (buffer_index & 1). */
     h->reserved2 = (uint16_t)(adc_get_buffer_parity(cf->dma_seq) & 0x07u);
    
    uint16_t crc = cf->crc16;
    if(crc == 0 && payload_len){ crc = vnd_crc16_ccitt(cf->buf + VND_FRAME_HDR_SIZE, payload_len); }
    h->crc16 = crc;
    if(crc) h->flags |= 0x04; else h->flags &= (uint8_t)~0x04u;
    cf->frame_size = (uint16_t)total;
    if(cur_expected_frame_size && cf->frame_size != cur_expected_frame_size) dbg_size_mismatch++;
    dbg_any_valid_frame = 1; cf->st = FB_READY;
}

/* Поиск индекса пары по seq (линейный поиск по короткому кольцу) */
static int __attribute__((unused)) vnd_find_pair_by_seq(uint32_t seq)
{
    for(uint8_t i=0;i<VND_PAIR_BUFFERS;i++){
        if(g_frames[i][0].st != FB_FILL && g_frames[i][0].seq == seq) return (int)i;
        if(g_frames[i][1].st != FB_FILL && g_frames[i][1].seq == seq) return (int)i;
    }
    return -1;
}

/* Асинхронный выбор и отправка одного готового кадра (A или B) */
/* Режим строгой парности по желанию: 0 — независимые каналы, 1 — строгая пара A&B на один seq */
static uint8_t vnd_strict_pairing = 0;  /* ОТКЛЮЧЕНО: каналы независимы, отправляем как только готов */

static int vnd_async_try_tx(void)
{
#if USE_TEST_SAWTOOTH
    /* В тестовом режиме не используем async-путь, чтобы не ждать ADC/DMA */
    return 0;
#endif
    /* ПРОФИЛИРОВАНИЕ: замер времени выполнения */
    static uint32_t call_count = 0;
    static uint32_t total_time_us = 0;
    static uint32_t max_time_us = 0;
    static uint32_t last_profile_log = 0;
    uint32_t start_cyc = DWT->CYCCNT;
    
    /* Новый вариант async: не полагается на заранее собранную пару.
       Используем per-channel API adc_get_frame_ch() и локальные временные буферы построения кадров.
       Сохраняем on-wire формат (общий seq = stream_seq). */
    if(vnd_ep_busy) return 0;
    if(!full_mode) return 0;
    static uint8_t last_sent_ch = 1; /* чередование при наличии обоих */

    /* Глобальные счетчики текущей пары (для async строгой парности): бит0=A, бит1=B */
    static uint8_t seq_mask = 0;            /* какие каналы уже отправлены для текущего stream_seq */
    static uint32_t seq_mask_first_ms = 0;  /* время первого кадра неполной пары */
    static uint8_t seq_partial_cnt = 0;     /* сколько кадров отправлено без полной пары */

    /* Локальные статические рабочие буферы кадров для независимого построения */
    typedef struct { uint8_t valid; uint8_t ch; uint16_t samples; uint32_t seq; uint32_t dma_seq; uint16_t frame_len; uint8_t buf[VND_FRAME_MAX_SIZE]; } tmp_frame_t;
    static tmp_frame_t tf[2];

    /* Обновить / заполнить структуру для канала, если данных ещё нет (valid=0) */
    for(int ch=0; ch<2; ++ch){
        if(ch==1 && vnd_ch_mode==0) continue; /* A-only */
        if(ch==0 && vnd_ch_mode==1) continue; /* B-only */
        if(tf[ch].valid) continue; /* уже подготовлен */
        uint16_t *abuf = NULL; uint16_t samples = 0; uint32_t dma_seq = 0; uint8_t synth = 0;
        /* Снапшоты для staging, чтобы TC не перезаписал во время копирования */
        static uint16_t stage_copy_async[MAX_FRAME_SAMPLES];
        static uint16_t stage_copy_async_b[MAX_FRAME_SAMPLES];
        if(adc_get_frame_ch((uint8_t)ch, &abuf, &samples, &dma_seq)){
            synth = 0;
        } else if(TEST_OVERLAY_SAWTOOTH){
            /* Если реальный буфер временно не готов, синтезируем кадр, чтобы гарантировать 2 канала. */
            samples = adc_stream_get_active_samples();
            if(samples == 0) samples = VND_FULL_DEFAULT_SAMPLES;
            synth = 1;
        }
        if(samples){
            /* ROI: берём строго окно [win_start0 : win_start0+win_len0) из DMA-буфера */
            uint16_t roi_start = 0;
            uint16_t roi_len = 0;
            if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI){
                roi_start = win_start0;
                roi_len   = win_len0;
                if(roi_len == 0u){ roi_start = 280u; roi_len = 200u; }
                if(roi_len > VND_MAX_SAMPLES) roi_len = VND_MAX_SAMPLES;
                if(!synth){
                    /* Если профиль не подходит под ROI — не шлём «не тот» кусок */
                    if(samples < (uint16_t)(roi_start + roi_len)){
                        /* Чтобы не зависнуть (lossless peek), деградируем к отправке всего доступного буфера */
                        roi_start = 0;
                        roi_len = samples;
                    }
                }
                /* В ROI режиме формат фиксирован длиной окна */
                cur_samples_per_frame = roi_len;
                cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)roi_len * 2u);
            } else {
                if(cur_samples_per_frame == 0){
                    /* Лочим текущий формат по первому пришедшему размеру (реальному или синтетическому) */
                    uint16_t eff = samples;
                    if(vnd_frame_samples_req && vnd_frame_samples_req < eff) eff = vnd_frame_samples_req;
                    if(vnd_trunc_samples && vnd_trunc_samples < eff) eff = vnd_trunc_samples;
                    if(eff > VND_MAX_SAMPLES) eff = VND_MAX_SAMPLES;
                    cur_samples_per_frame = eff;
                    cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)eff*2u);
                    cdc_logf("FRAME_LOCK ch=%u adc_samp=%u req=%u trunc=%u -> eff=%u", ch, samples, vnd_frame_samples_req, vnd_trunc_samples, eff);
                }
            }

            uint16_t eff = cur_samples_per_frame;
            if(vnd_stream_mode != VND_STREAM_MODE_LOSSLESS_ROI){
                if(!synth && eff > samples) eff = samples; /* защита, если размер профиля уменьшился внезапно */
            }
            if(eff > VND_MAX_SAMPLES) eff = VND_MAX_SAMPLES;

            /* Базовый указатель источника (ROI смещает начало) */
            uint16_t *src = abuf;
            if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI && !synth){
                src = abuf + roi_start;
            }
            
            /* ДИАГНОСТИКА: проверяем последние 100 сэмплов DMA буфера на нули (только реальный буфер) */
            static uint32_t zero_check_count = 0; (void)zero_check_count;
            static uint32_t last_zero_check_ms = 0;
            uint32_t now_check = HAL_GetTick();
            if(!synth && now_check - last_zero_check_ms >= 5000 && eff >= 100){  /* Каждые 5 сек */
                uint16_t zeros_found = 0;
                for(uint16_t i = eff - 100; i < eff; i++){
                    if(abuf[i] == 0) zeros_found++;
                }
                cdc_logf("[USB_DIAG] CH%u: last 100 samples, %u zeros. [%u..%u]=[%u,%u,%u,%u,%u]",
                         ch, zeros_found, eff-100, eff-1,
                         abuf[eff-100], abuf[eff-50], abuf[eff-25], abuf[eff-10], abuf[eff-1]);
                last_zero_check_ms = now_check;
            }
            
            /* Если это staging, скопируем под защитой IRQ в локальный снапшот.
               В ROI режиме копируем только окно, чтобы гарантировать корректный срез. */
            if(!synth && ADC_USB_STAGE_ENABLE){
                __disable_irq();
                uint16_t stage_ns = eff;
                if(stage_ns > MAX_FRAME_SAMPLES) stage_ns = MAX_FRAME_SAMPLES;
                if(ch==0){
                    memcpy(stage_copy_async, src, stage_ns * sizeof(uint16_t));
                    src = stage_copy_async;
                } else {
                    memcpy(stage_copy_async_b, src, stage_ns * sizeof(uint16_t));
                    src = stage_copy_async_b;
                }
                __enable_irq();
            }
            /* Построить payload: overlay off = реальные ADC; overlay on = детерминированные пилы */
            for(uint16_t i=0;i<eff;i++){
#if TEST_OVERLAY_SAWTOOTH
                uint16_t v = (uint16_t)(i + 1);
                if(ch == 1){ v = (uint16_t)(((i + 1u) * 2u + 512u) & 0x0FFFu); }
#else
                uint16_t v = synth ? (uint16_t)(i + 1) : src[i];
#if VND_ENABLE_ADC_SANITIZE
                if(!synth){
                    if(v > 4095u){ dbg_gt4095_ch[ch]++; /* считаем, но не правим */ }
                }
#endif
#endif
                uint8_t *p = tf[ch].buf + VND_FRAME_HDR_SIZE + 2u*i; p[0]=(uint8_t)(v & 0xFF); p[1]=(uint8_t)(v>>8);
            }
            /* Заголовок */
            vnd_frame_hdr_t *h = (vnd_frame_hdr_t*)tf[ch].buf;
            h->magic = 0xA55A; h->ver = 0x01; h->flags = (ch==0)?0x01:0x02; 
            h->seq = dma_seq;  /* seq привязан к DMA-кадру */
            h->timestamp = HAL_GetTick(); h->total_samples = eff;
            if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI){
                h->zone_count = 1;
                h->zone1_offset = (uint32_t)win_start0;
                h->zone1_length = (uint32_t)eff;
            } else {
                h->zone_count=0; h->zone1_offset=0; h->zone1_length=0;
            }
            /* Пробрасываем индекс DMA-буфера канала, чтобы хост мог отрисовывать строго в порядке заполнения DMA */
            h->reserved  = dma_seq;
            
            /* reserved2 несёт buffer_index (0..7) */
            h->reserved2 = (uint16_t)(adc_get_buffer_parity(dma_seq) & 0x07u);
            
