kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
            h->crc16=0;
            uint16_t crc = vnd_crc16_ccitt(tf[ch].buf + VND_FRAME_HDR_SIZE, (uint32_t)eff * 2u);
            h->crc16 = crc; if(crc) h->flags |= 0x04; else h->flags &= (uint8_t)~0x04u;
            tf[ch].samples = eff; tf[ch].seq = stream_seq; tf[ch].dma_seq = dma_seq; tf[ch].frame_len = (uint16_t)(VND_FRAME_HDR_SIZE + eff*2u); tf[ch].ch = (uint8_t)ch; tf[ch].valid = 1;

            /* LOSSLESS: adc_get_frame_ch() теперь делает peek; подтверждаем consume только после копирования */
            if(!synth){ (void)adc_consume_frame_ch((uint8_t)ch, dma_seq); }
        }
    }

    /* Выбор канала:
       1) Если валиден только один — берём его.
       2) Если оба — чередуем относительно last_sent_ch.
       3) Если ни одного — return 0. */
    int haveA = tf[0].valid ? 1:0;
    int haveB = tf[1].valid ? 1:0;
    int pick = -1;
    if(vnd_ch_mode == 2 && vnd_strict_pairing){
        /* Строгая парность: если оба готовы — чередуем, если готов только один и уже отправляли его для текущего seq — ждём второй */
        if(haveA && haveB){ pick = (last_sent_ch==0)?1:0; }
        else if(haveA && !haveB){ if(seq_mask == 0x01) return 0; pick = 0; }
        else if(haveB && !haveA){ if(seq_mask == 0x02) return 0; pick = 1; }
        else return 0;
    } else {
        /* Независимые каналы (дефолт): отправляем что есть, при наличии обоих — чередуем */
        if(haveA && !haveB) pick = 0;
        else if(haveB && !haveA) pick = 1;
        else if(haveA && haveB){ pick = (last_sent_ch==0)?1:0; }
        else return 0;
    }

    tmp_frame_t *sel = &tf[pick];
    if(!sel->valid) return 0;
    
    /* Гарантируем согласованность метаданных заголовка с DMA-кадром */
    vnd_frame_hdr_t *h = (vnd_frame_hdr_t*)sel->buf;
    h->seq = h->reserved; /* seq = dma_seq (32-битное значение) */
    h->reserved2 = (uint16_t)(adc_get_buffer_parity(h->reserved) & 0x07u);
    
    if(vnd_transmit_frame(sel->buf, sel->frame_len, 0, 0, pick==0?"ADC0-ASY2":"ADC1-ASY2") == USBD_OK){
        /* Учёт статистики предварительно (окончательная фиксация в TxCplt) */
        if(pick==0) dbg_sent_ch0_total++; else dbg_sent_ch1_total++;
        sending_channel = (uint8_t)pick; sel->valid = 0; last_sent_ch = (uint8_t)pick;
        /* Логика продвижения общего seq в async режиме.
           Базово: ждём кадры A и B (seq_mask==0x3) -> инкремент.
           Проблема: если один канал (например B) долго не приходит, мы зацикливаемся на одном seq.
           Решение: fallback по таймауту или числу односторонних кадров. */
        uint32_t now_ms_local = HAL_GetTick();
        if(vnd_ch_mode==2 && vnd_strict_pairing){
            seq_mask |= (uint8_t)(1u<<pick);
            if(seq_mask_first_ms == 0) seq_mask_first_ms = now_ms_local;
            if(seq_mask == 0x3){
                /* Оба канала отправили по кадру текущего seq — продвигаем */
                seq_mask = 0; seq_mask_first_ms = 0; seq_partial_cnt = 0;
                stream_seq++; dbg_produced_seq++;
            } else {
                /* Строгая парность: не продвигаем seq, пока не отправлены оба канала. */
                seq_partial_cnt++;
                uint32_t dt_ms = (now_ms_local >= seq_mask_first_ms) ? (now_ms_local - seq_mask_first_ms) : (0xFFFFFFFFu - seq_mask_first_ms + 1u + now_ms_local);
                if(dt_ms > 1000 && (seq_partial_cnt % 8) == 0){
                    VND_LOG("ASYNC_WAIT_PAIR seq=%lu mask=0x%02X cnt=%u dt=%lums", (unsigned long)stream_seq, (unsigned)seq_mask, (unsigned)seq_partial_cnt, (unsigned long)dt_ms);
                }
            }
        } else if (vnd_ch_mode==2 && !vnd_strict_pairing){
            /* Независимые каналы: продвигаем seq каждый кадр, сохраняя общую временную шкалу */
            stream_seq++; dbg_produced_seq++;
            seq_mask = 0; seq_mask_first_ms = 0; seq_partial_cnt = 0; /* сброс */
        } else {
            /* В режиме single-channel seq просто инкрементируется каждый кадр */
            stream_seq++; dbg_produced_seq++;
            seq_mask = 0; seq_mask_first_ms = 0; seq_partial_cnt = 0; /* сброс */
        }
        /* ПРОФИЛИРОВАНИЕ: успешная отправка */
        uint32_t end_cyc = DWT->CYCCNT;
        uint32_t elapsed_cyc = (end_cyc >= start_cyc) ? (end_cyc - start_cyc) : (0xFFFFFFFFu - start_cyc + end_cyc + 1);
        uint32_t elapsed_us = elapsed_cyc / (SystemCoreClock / 1000000u);
        call_count++;
        total_time_us += elapsed_us;
        if(elapsed_us > max_time_us) max_time_us = elapsed_us;
        
        uint32_t now_profile = HAL_GetTick();
        if(now_profile - last_profile_log >= 5000){
            uint32_t avg_us = call_count ? (total_time_us / call_count) : 0;
            printf("[PROF_TX] calls=%lu avg=%lu.%luus max=%lu.%luus\r\n",
                   call_count, avg_us, (elapsed_us%10), max_time_us, (max_time_us%10));
            call_count = 0; total_time_us = 0; max_time_us = 0;
            last_profile_log = now_profile;
        }
        return 1;
    }
    
    /* ПРОФИЛИРОВАНИЕ: не отправлено (нет данных) */
    uint32_t end_cyc = DWT->CYCCNT;
    uint32_t elapsed_cyc = (end_cyc >= start_cyc) ? (end_cyc - start_cyc) : (0xFFFFFFFFu - start_cyc + end_cyc + 1);
    uint32_t elapsed_us = elapsed_cyc / (SystemCoreClock / 1000000u);
    call_count++;
    total_time_us += elapsed_us;
    if(elapsed_us > max_time_us) max_time_us = elapsed_us;
    
    return 0;
}

/* allow_zero_samples используется как флаги:
 *  bit0 (1): разрешить total_samples==0
 *  bit1 (2): разрешить длину >= ожидаемой и кратную 64 (для паддинга до MPS)
 */
static int vnd_validate_frame(const uint8_t *buf, uint16_t len, uint8_t expect_test, uint8_t allow_flags)
{
    (void)expect_test;
    if (!buf || len < VND_FRAME_HDR_SIZE)
        return 0;
    const vnd_frame_hdr_t *h = (const vnd_frame_hdr_t*)buf;
    if (h->magic != 0xA55A)
        return 0;
    if (h->total_samples > VND_MAX_SAMPLES)
        return 0;
    if (!(allow_flags & 0x01) && h->total_samples == 0)
        return 0;
    {
        uint16_t expected = (uint16_t)(VND_FRAME_HDR_SIZE + h->total_samples * 2u);
        if (len != expected) {
            /* Разрешаем «припадиненные» кадры: длина >= expected и кратна 64 байтам (FS/HS совместимо) */
            if ((allow_flags & 0x02) == 0) return 0;
            if (len < expected) return 0;
            if ((len % 64u) != 0u) return 0;
        }
    }
    return 1;
}

