kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* stream_mode=2: постоянно дренируем FIFO и готовим усреднённые ROI кадры в очереди.
       Это критично для "lossless" поведения (потребление ADC не должно зависеть от скорости USB). */
    if(full_mode && !diag_mode_active && vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        /* Выполняем загрузку DC из Flash в main-loop как можно раньше (после SET_STREAM_MODE).
           Это помогает после перезагрузки не начинать адаптацию "с нуля" из-за задержки загрузки. */
        if(vnd_dc_load_request){
            vnd_dc_load_request = 0;
            vnd_dc_load_once();
        }
        uint16_t roi_start = win_start0;
        uint16_t roi_len   = win_len0;
        if(roi_len == 0u){ roi_start = 280u; roi_len = 200u; }
        vnd_avg_drain_fifo(roi_start, roi_len);

        /* Периодическое сохранение DC в Flash (если менялся): вызывать всегда, а не только в 1Hz сводке.
           Внутри есть троттлинг по времени и флаг dirty. */
        vnd_dc_try_save_periodic();

        /* Периодическая сводка (UART): помогает понять реальный коэффициент усреднения и состояние очереди */
        uint32_t now_ms = HAL_GetTick();
        if(dbg_avg_last_print_ms == 0){ dbg_avg_last_print_ms = now_ms; }
        if((now_ms - dbg_avg_last_print_ms) >= 1000u){
            uint32_t in_now = dbg_avg_in_frames;
            uint32_t out_now = dbg_avg_out_frames;
            uint32_t tx_now = dbg_avg_tx_pairs;
            uint32_t din = in_now - dbg_avg_in_last;
            uint32_t dout = out_now - dbg_avg_out_last;
            uint32_t dtx = tx_now - dbg_avg_tx_last;
            dbg_avg_in_last = in_now; dbg_avg_out_last = out_now; dbg_avg_tx_last = tx_now;
            dbg_avg_last_print_ms = now_ms;
                 uint32_t dsp_avg_us = (vnd_dsp.dsp_us_cnt ? (vnd_dsp.dsp_us_total / vnd_dsp.dsp_us_cnt) : 0u);
                 printf("[AVG] n=%u q=%u cnt0=%u cnt1=%u in=%lu(+%lu/s) out=%lu(+%lu/s) tx=%lu(+%lu/s) dsp=%luus(avg) %luus(max) corr_eo=(%.3f,%.3f) corr_ab=(e=%.3f,o=%.3f)\r\n",
                   (unsigned)vnd_avg_n, (unsigned)vnd_avg_q_count,
                   (unsigned)vnd_avg_cnt[0], (unsigned)vnd_avg_cnt[1],
                   (unsigned long)in_now, (unsigned long)din,
                   (unsigned long)out_now, (unsigned long)dout,
                     (unsigned long)tx_now, (unsigned long)dtx,
                     (unsigned long)dsp_avg_us, (unsigned long)vnd_dsp.dsp_us_max,
                     (double)vnd_dsp.corr_eo[0], (double)vnd_dsp.corr_eo[1],
                     (double)vnd_dsp.corr_ab[0], (double)vnd_dsp.corr_ab[1]);

                     /* DC save вызывается выше (вне 1Hz блока), чтобы не зависеть от печати. */

                 /* сбрасываем только тайминг, оставляя последние corr значения */
                 vnd_dsp.dsp_us_total = 0;
                 vnd_dsp.dsp_us_cnt = 0;
                 vnd_dsp.dsp_us_max = 0;
        }
    }

    /* Универсальная антиклин‑разблокировка EP: если IN висит >200 мс — принудительно снимаем busy */
    do {
        uint32_t now_ms = HAL_GetTick();
        extern uint8_t USBD_VND_TxIsBusy(void);
        uint8_t vbusy = USBD_VND_TxIsBusy();
        if ( (vnd_ep_busy || vbusy) && vnd_last_tx_start_ms != 0 && (now_ms - vnd_last_tx_start_ms) > 200) {
            extern void USBD_VND_ForceTxIdle(void);
            USBD_VND_ForceTxIdle();
            vnd_ep_busy = 0; vnd_tx_ready = 1;
            VND_LOG("EP_UNSTUCK after %lums (len=%u) vbusy=%u", (unsigned long)(now_ms - vnd_last_tx_start_ms), (unsigned)vnd_last_tx_len, (unsigned)vbusy);
        }
    } while(0);

    /* ACK-STAT на START: отключено, чтобы не занимать Vendor IN перед первой парой.
       Хост может опрашивать состояние через GET_STATUS (EP0). */
    if(status_ack_pending){ start_ack_done = 1; status_ack_pending = 0; }

    uint32_t now = HAL_GetTick();
    /* Fallback: если ACK так и не ушёл в полёт (status_ack_pending держится),
       не ждём бесконечно — считаем ACK выполненным и продолжаем к TEST. */
    if(!test_sent && !start_ack_done && status_ack_pending){
        if(now - start_cmd_ms > 200){
            start_ack_done = 1; status_ack_pending = 0;
            vnd_ep_busy = 0; vnd_tx_ready = 1;
            extern void USBD_VND_ForceTxIdle(void); USBD_VND_ForceTxIdle();
            VND_LOG("ACK_FALLBACK(no inflight) -> allow TEST");
            if(!vnd_ep_busy){ vnd_try_send_test_from_task(); }
        }
    }

    if(!test_sent && start_stat_inflight) {
        if(now - vnd_last_tx_start_ms > 80) {
            /* На некоторых хостах ACK-STAT может не завершиться DataIn/ZLP. Разблокируем вручную. */
            start_stat_inflight = 0; start_ack_done = 1; vnd_ep_busy = 0; vnd_tx_ready = 1;
            extern void USBD_VND_ForceTxIdle(void); USBD_VND_ForceTxIdle();
            VND_LOG("ACK_TIMEOUT -> unlock test");
            /* Сразу отдадим ещё один STAT (если был queued) и попробуем отправить TEST */
            if(pending_status && !vnd_ep_busy){
                vnd_try_send_pending_status_from_task();
            }
            if(!vnd_ep_busy){
#if !VND_DISABLE_TEST
                vnd_try_send_test_from_task();
#endif
            }
        }
    }
    /* Аварийный обход: если тест не ушёл за разумное время после START — считаем его выполненным и продолжаем */
    if(!test_sent && (now - start_cmd_ms) > 160) {
        test_in_flight = 0;
        test_sent = 1;
        start_ack_done = 1;
        VND_LOG("TEST_FALLTHRU after %lums -> proceed to A/B", (unsigned long)(now - start_cmd_ms));
    }

    /* ASYNC MODE: используем только vnd_async_try_tx() (без legacy prepare_pair/pump).
       Иначе старый парный путь может потреблять/копировать ADC и перегружать CPU/логи,
       что приводит к остановке/редким кадрам на хосте после первых нескольких фреймов. */
#if !USE_TEST_SAWTOOTH
    if(async_mode && full_mode && !diag_mode_active){
        if(!vnd_ep_busy){ (void)vnd_async_try_tx(); }
        if(vnd_tick_flag) vnd_tick_flag = 0;
        vnd_cdc_periodic_stats(now);
        return;
    }
#endif
    /* ВАЖНО: сначала попробуем подготовить пару A/B, чтобы не зациклиться на ранних STAT.
       Подготовка пары не зависит от занятости EP, поэтому убираем лишний гейтинг по vnd_ep_busy. */
    {
        ChanFrame *fA0 = &g_frames[pair_send_idx][0];
        if(fA0->st != FB_READY){ vnd_prepare_pair(); }
    }
    /* Раннее окно для GET_STATUS до первой пары — отключено: STAT по IN только между парами. */
    /* Подавляем TEST в фазе pending_init: сосредоточиться на ускорении первой A пары */
    if(vnd_pending_init){
        /* Быстрый init-pump: до 200 мс после START каждые ~2 мс пробуем подготовить и отправить A
           Расширено: используем текущий pair_fill_idx вместо жёсткого [0], добавлен ранний STAT и ослабленный fresh gating. */
        static uint32_t last_pump_ms = 0;
        extern volatile uint32_t frame_wr_seq;
        static uint32_t start_wr_seq_snapshot = 0; /* первый wr_seq на момент START */
        if(start_wr_seq_snapshot == 0){ start_wr_seq_snapshot = frame_wr_seq; }
        if(start_cmd_ms && (now - start_cmd_ms) < 200){
            if(now - last_pump_ms > 2){
                last_pump_ms = now;
                init_pump_attempts++;
                ChanFrame *fAfill = &g_frames[pair_send_idx][0];
                if(fAfill->st != FB_READY){ vnd_prepare_pair(); fAfill = &g_frames[pair_send_idx][0]; }
                     /* Ранний relax: первые 20 мс достаточно одного инкремента wr_seq, далее требуем +2.
                         Доп. послабление: после 100 мс позволяем отправить первую A даже без прироста wr_seq
                         (на случай, если ADC успел подготовить кадр, но счётчик ещё не вырос). */
                 uint32_t age_ms = now - start_cmd_ms;
                 #if USE_TEST_SAWTOOTH
                     uint8_t fresh_ok = 1u; /* в тестовом режиме не ждём рост wr_seq от ADC/DMA */
                 #else
                     uint8_t fresh_ok = (age_ms < 20) ? (frame_wr_seq > start_wr_seq_snapshot ? 1u : 0u)
                                                        : (frame_wr_seq > start_wr_seq_snapshot + 1 ? 1u : 0u);
                 #endif
                /* Защитная инициализация размера кадра если ADC уже дал конфигурацию, но SIZE_LOCK не прошёл */
                if(cur_samples_per_frame == 0 && age_ms > 25){
                    uint16_t prof_s = adc_stream_get_active_samples();
                    uint16_t eff_s = prof_s;
                    if(vnd_frame_samples_req && vnd_frame_samples_req < eff_s) eff_s = vnd_frame_samples_req;
                    if(vnd_trunc_samples && vnd_trunc_samples < eff_s) eff_s = vnd_trunc_samples;
                    if(eff_s > VND_MAX_SAMPLES) eff_s = VND_MAX_SAMPLES;
                    if(eff_s){
                        cur_samples_per_frame = eff_s;
                        cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame*2u);
                    }
                }
                /* Ещё один страховочный замок: после 60 мс если размер всё ещё 0 — попробуем взять текущий active_samples и вывести диагностику */
                if(cur_samples_per_frame == 0 && age_ms == 60){
                    uint16_t prof_s2 = adc_stream_get_active_samples();
                    uint16_t eff_s2 = prof_s2;
                    if(vnd_frame_samples_req && vnd_frame_samples_req < eff_s2) eff_s2 = vnd_frame_samples_req;
                    if(vnd_trunc_samples && vnd_trunc_samples < eff_s2) eff_s2 = vnd_trunc_samples;
                    if(eff_s2 > VND_MAX_SAMPLES) eff_s2 = VND_MAX_SAMPLES;
                    if(eff_s2){
                        cur_samples_per_frame = eff_s2;
                        cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame*2u);
                    }
                    cdc_logf("INIT_DBG age=%lu wr=%lu fA_st=%u cur_s=%u ep_busy=%u",
                             (unsigned long)age_ms, (unsigned long)frame_wr_seq, (unsigned)fAfill->st,
                             (unsigned)cur_samples_per_frame, (unsigned)vnd_ep_busy);
                }
                /* ======================================================================
                 * КРИТИЧНО: ранний STAT для инициации хендшейка с хостом.
                 * Условие: ТОЛЬКО если streaming=1 (значит START уже был получен) И
                 * ещё не отправлена первая пара (first_pair_done=0).
                 * Защита от RACE: проверяем streaming=1, что гарантирует что STOP не был вызван.
                 * ====================================================================== */
                if(streaming && !vnd_stream_active && !pending_status && age_ms > 30 && age_ms < 150 && !first_pair_done){
                    pending_status = 1;
                    vnd_status_permit_once = 1;
                    if(!vnd_ep_busy && !vnd_inflight){ vnd_try_send_pending_status_from_task(); }
                }
                /* Разрешаем первую A, если кадр готов и либо fresh_ok, либо прошло уже >100 мс (fallback) */
                if(fAfill->st == FB_READY && (fresh_ok || age_ms > 100) && !vnd_ep_busy){
                    if(vnd_transmit_frame(fAfill->buf, fAfill->frame_size, 0, 0, "ADC0-PUMP") == USBD_OK){
                        fAfill->st = FB_SENDING; sending_channel = 0;
                        pending_B = (vnd_ch_mode == 0)?0:1; if(pending_B) pending_B_since_ms = HAL_GetTick();
                        vnd_pending_init = 0; vnd_stream_active = 1; init_pump_a_sent++;
                        VND_LOG("INIT_PUMP_A queued size=%u wr_seq=%lu age=%lums fresh=%u", (unsigned)fAfill->frame_size, (unsigned long)frame_wr_seq, (unsigned long)age_ms, (unsigned)fresh_ok);
                        /* После первой A выходим из init-pump */
                    }
                }
            }
        }
    } else {
        /* Старое окно отправки TEST переносим сюда (вне pending_init), если TEST разрешён */
        if(!test_sent && !test_in_flight){
            if(!vnd_ep_busy && (now - start_cmd_ms) > 50){
#if !VND_DISABLE_TEST
                vnd_try_send_test_from_task();
#endif
                if(vnd_ep_busy){ if(vnd_tick_flag) vnd_tick_flag = 0; return; }
            }
        }
    }
    /* CRITICAL WATCHDOG: Если TxCplt не пришёл > 500ms, принудительно сбрасываем inflight.
       Причина: на Windows хост может "забыть" забрать данные или ZLP не отправился.
       Без этого устройство зависает с vnd_inflight=1 навсегда. */
    if(vnd_inflight){
        uint32_t dt_ms = (now >= vnd_last_tx_start_ms) ? (now - vnd_last_tx_start_ms) : (0xFFFFFFFFu - vnd_last_tx_start_ms + 1u + now);
        if(dt_ms > 500){
            VND_LOG("WATCHDOG: vnd_inflight stuck for %lums, force reset", (unsigned long)dt_ms);
        cdc_logf("!!! WATCHDOG: TX stuck, force reset (dt=%lu ms)", (unsigned long)dt_ms);
        vnd_inflight = 0;
        vnd_ep_busy = 0;
        vnd_tx_ready = 1;
        sending_channel = 0xFF;
        /* Пытаемся восстановить передачу */
        vnd_tx_kick = 1;
        }
    }
    
    if(test_in_flight && (now - vnd_last_tx_start_ms) > 100){
        /* На некоторых хостах (FS/RPi) DataIn может не вызваться после короткого TEST.
           Чтобы не зависнуть с занятым EP, снимаем busy и продолжаем. */
    test_in_flight = 0;
    test_sent = 1;
    vnd_ep_busy = 0;
    vnd_tx_ready = 1;
    extern void USBD_VND_ForceTxIdle(void); USBD_VND_ForceTxIdle();
        vnd_tx_kick = 1;
        VND_LOG("TEST_TIMEOUT -> unlock EP");
    }
    if(!test_sent && !vnd_pending_init){
        if(!vnd_ep_busy){
#if !VND_DISABLE_TEST
            vnd_try_send_test_from_task();
#endif
        }
        /* Не выходим раньше времени: позволим подготовку/отправку A/B идти параллельно. */
    }

