kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    if(diag_mode_active){
        /* Зафиксируем размер один раз */
        if(cur_samples_per_frame == 0){
            uint16_t s = diag_samples; if(s > VND_MAX_SAMPLES) s = VND_MAX_SAMPLES;
            cur_samples_per_frame = s;
            cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + cur_samples_per_frame*2u);
        }
        /* Подготовить пару для текущего stream_seq, если ещё не подготовлена и не идёт передача */
        if(sending_channel == 0xFF && !pending_B && diag_prepared_seq != stream_seq){
            vnd_diag_prepare_pair(stream_seq, cur_samples_per_frame);
            diag_prepared_seq = stream_seq;
        }
        /* В DIAG STAT через bulk полностью заблокирован (см. vnd_try_send_pending_status_from_task) */
        /* Отправка диагностических кадров без темпирования: A затем B */
        if(!vnd_ep_busy){ (void)vnd_diag_try_tx(); }
        if(vnd_tick_flag) vnd_tick_flag = 0;
        vnd_cdc_periodic_stats(now);
        return;
    }
    
    if(!full_mode){ if(vnd_tick_flag) vnd_tick_flag = 0; return; }

    /* Новый упрощённый путь: асинхронная передача A/B без ожидания пары.
       В тестовом режиме (USE_TEST_SAWTOOTH) async отключаем, чтобы не выйти
       из таска без фактической отправки кадров. */
#if !USE_TEST_SAWTOOTH
    if(async_mode){
        /* Всегда стараться иметь подготовленные пары */
        ChanFrame *fa0 = &g_frames[pair_fill_idx][0];
        if(fa0->st != FB_READY){ vnd_prepare_pair(); }
        if(!vnd_ep_busy){ (void)vnd_async_try_tx(); }
        if(vnd_tick_flag) vnd_tick_flag = 0;
        vnd_cdc_periodic_stats(now);
        return;
    }
#endif

    /* Упреждающая подготовка пары: когда TEST уже завершён и B не ожидается. */
    if(test_sent && !pending_B){
        ChanFrame *fa_chk = &g_frames[pair_send_idx][0];
        if(fa_chk->st != FB_READY){ vnd_prepare_pair(); }
    }

    /* Окно для GET_STATUS: отправлять STAT строго между парами, чтобы не разрывать A/B. */
    if(!vnd_ep_busy && !vnd_inflight && pending_status){
        if (test_sent && !pending_B && first_pair_done && sending_channel == 0xFF) {
            vnd_try_send_pending_status_from_task();
            if(vnd_ep_busy){ if(vnd_tick_flag) vnd_tick_flag = 0; return; }
        }
    }

    if(vnd_tx_kick) vnd_tx_kick = 0;
    
    /* Разрешаем подготовку следующей пары даже если EP занят (параллельная заполнение буферов) */
    /* if(vnd_ep_busy){ if(vnd_tick_flag) vnd_tick_flag = 0; return; } */

    /* Если TEST уже логически завершён, но его мета застряла в FIFO (нет TxCplt) —
       через ~60 мс превращаем её в служебную, чтобы не блокировать отправку A. */
    vnd_force_complete_test_meta_if_stale();

    static __attribute__((unused)) uint8_t first_pair_logged = 0; /* диагностический лог первой пары */

    static uint8_t first_bq_logged = 0; /* однократный лог первой постановки B */
    if(pending_B){
        /* В A-only режиме не ждём B, сразу продолжим к следующему A */
        if(vnd_ch_mode == 0){
            ChanFrame *f0 = &g_frames[pair_send_idx][0];
            ChanFrame *f1 = &g_frames[pair_send_idx][1];
            f0->st = f1->st = FB_FILL;
            pair_send_idx = (uint8_t)((pair_send_idx + 1u) % VND_PAIR_BUFFERS);
            stream_seq++; dbg_produced_seq++;
            pending_B = 0; pending_B_since_ms = 0; sending_channel = 0xFF;
            /* Попробуем запланировать немедленную отправку следующего A */
            ChanFrame *fA2 = &g_frames[pair_send_idx][0];
            if(fA2->st != FB_READY){ vnd_prepare_pair(); }
            if(fA2->st == FB_READY && !vnd_ep_busy){
                if (vnd_transmit_frame(fA2->buf, fA2->frame_size, 0, 0, "ADC0-IMM-AONLY") == USBD_OK){
                    fA2->st = FB_SENDING; sending_channel = 0; return; }
            }
            /* если не получилось — просто продолжим общий цикл */
        }
        /* Гарантируем, что текущая пара действительно подготовлена: если A ещё не готов (FB_FILL) — соберём пару сейчас. */
        ChanFrame *fA_pre = &g_frames[pair_send_idx][0];
        if(fA_pre->st == FB_FILL && !vnd_ep_busy){ vnd_prepare_pair(); }
        ChanFrame *fB = &g_frames[pair_send_idx][1];
        if(fB->st == FB_READY){
            USBD_StatusTypeDef rcB = vnd_transmit_frame(fB->buf, fB->frame_size, 0, 0, "ADC1");
            if (rcB == USBD_OK) {
                if(!first_bq_logged){ first_bq_logged = 1; VND_LOG("FIRST_B queued size=%u", (unsigned)fB->frame_size); }
                fB->st = FB_SENDING; sending_channel = 1; return;
            } else if (rcB == USBD_BUSY) {
                static uint32_t b_busy_retry = 0; b_busy_retry++;
                if (b_busy_retry == 1 || (b_busy_retry % 10) == 0) {
                    VND_LOG("B_BUSY_RETRY cnt=%lu", (unsigned long)b_busy_retry);
                }
                /* оставляем кадр в READY и попробуем позже */
            } else {
                VND_LOG("B_TX_FAIL rc=%d", (int)rcB);
            }
        } else {
            /* Диагностируем, почему ждём B: выводим периодически и в CDC (1 Гц) текущее состояние */
            static uint32_t last_log_ms = 0;
            static uint32_t last_cdc_ms = 0;
            uint32_t now_ms = HAL_GetTick();
            if(now_ms - last_log_ms > 200){
                VND_LOG("WAIT_B st=%u seq=%lu cur_seq=%lu", (unsigned)fB->st, (unsigned long)fB->seq, (unsigned long)stream_seq);
                last_log_ms = now_ms;
            }
            if(now_ms - last_cdc_ms > 1000){
                extern uint8_t USBD_VND_TxIsBusy(void);
                uint8_t ll_busy = USBD_VND_TxIsBusy();
                const char *stA = (g_frames[0][0].st==FB_READY?"READY":(g_frames[0][0].st==FB_SENDING?"SENDING":"FILL"));
                const char *stB = (g_frames[0][1].st==FB_READY?"READY":(g_frames[0][1].st==FB_SENDING?"SENDING":"FILL"));
                uint32_t age_ms = pending_B_since_ms? (now_ms - pending_B_since_ms) : 0;
                cdc_logf("DBG WAIT_B age=%lums A=%s B=%s ep_busy=%u ll_busy=%u metaDepth=%u lastTX=%u", (unsigned long)age_ms, stA, stB, (unsigned)vnd_ep_busy, (unsigned)ll_busy, (unsigned)vnd_tx_meta_depth(), (unsigned)vnd_last_tx_len);
                last_cdc_ms = now_ms;
            }
            /* Watchdog B: если B уже в полёте и нет TxCplt слишком долго — форсируем завершение пары */
            if(fB->st == FB_SENDING && (now_ms - vnd_last_tx_start_ms) > 150){
                /* Не закрываем пару! Снимаем busy, нейтрализуем старую мета и переотправляем B */
                extern void USBD_VND_ForceTxIdle(void); USBD_VND_ForceTxIdle();
                vnd_ep_busy = 0; vnd_tx_ready = 1; vnd_inflight = 0;
                vnd_meta_neutralize(0x02, g_frames[pair_send_idx][1].seq);
                g_frames[pair_send_idx][1].st = FB_READY; sending_channel = 0xFF;
                VND_LOG("B_TXCPLT_WD (>150ms) -> retry B seq=%lu", (unsigned long)g_frames[pair_send_idx][1].seq);
                /* Попробуем сразу переотправить */
                ChanFrame *fB2 = &g_frames[pair_send_idx][1];
                if(!vnd_ep_busy && fB2->st == FB_READY){
                    if(vnd_transmit_frame(fB2->buf, fB2->frame_size, 0, 0, "ADC1-RETRY") == USBD_OK){ fB2->st = FB_SENDING; sending_channel = 1; return; }
                }
            }
            /* Не синтезируем B: ждём реальные данные, пока EP свободен */
        }
        /* Дополнительный watchdog зависшего pending_B, даже если fB->st перешёл из READY в FILL из-за сброса */
        do {
            uint32_t now_ms2 = HAL_GetTick();
            if(!vnd_ep_busy && sending_channel == 0xFF && (now_ms2 - vnd_last_txcplt_ms) > 40){
                ChanFrame *fBchk = &g_frames[pair_send_idx][1];
                ChanFrame *fAchk = &g_frames[pair_send_idx][0];
                if(fAchk->st != FB_SENDING && fBchk->st != FB_SENDING){
                    if(fBchk->st == FB_READY){
                        if (vnd_transmit_frame(fBchk->buf, fBchk->frame_size, 0, 0, "ADC1-WDG") == USBD_OK){
                            fBchk->st = FB_SENDING; sending_channel = 1; VND_LOG("PEND_B_WDG_RETRY len=%u", (unsigned)fBchk->frame_size); return; }
                    }
                    /* Строгий порядок A→B: НЕ сбрасываем pending_B.
                       Ждём или синтезируем B выше (см. B_SYNTH_READY), чтобы закрыть пару. */
                    if(fBchk->st != FB_READY){
                        VND_LOG("PEND_B_WDG_WAIT (a_st=%u b_st=%u seq=%lu)", (unsigned)fAchk->st, (unsigned)fBchk->st, (unsigned long)stream_seq);
                    }
                }
            }
        } while(0);
    } else {
    ChanFrame *fA = &g_frames[pair_send_idx][0];
        /* Watchdog: если A завис в SENDING и долго нет TxCplt — считаем A завершённым и переходим к B */
        do {
            uint32_t now_ms = HAL_GetTick();
            if (fA->st == FB_SENDING && (now_ms - vnd_last_tx_start_ms) > 120) {
                /* Не считаем A завершённым — лишь снимаем busy, нейтрализуем старую мета и открываем ожидание B */
                VND_LOG("A_TXCPLT_WD (>120ms) -> open pending_B, neutralize A meta, continue");
                extern void USBD_VND_ForceTxIdle(void); USBD_VND_ForceTxIdle();
                vnd_ep_busy = 0; vnd_tx_ready = 1; vnd_inflight = 0; sending_channel = 0xFF;
                vnd_meta_neutralize(0x01, g_frames[0][0].seq);
                pending_B = 1; pending_B_since_ms = now_ms;
            }
        } while(0);
        if(fA->st != FB_READY){ 
            vnd_prepare_pair(); 
            fA = &g_frames[pair_send_idx][0]; 
        }
    if(fA->st == FB_READY){
            /* Искусственных задержек между кадрами нет: отправляем A сразу при готовности EP и данных */
            /* Отправляем A: в режиме без TEST не проверяем test_in_flight вовсе */
#if VND_DISABLE_TEST
            VND_LOG("TRY_A len=%u hdr_seq=%lu", (unsigned)fA->frame_size, (unsigned long)((vnd_frame_hdr_t*)fA->buf)->seq);
            if (vnd_transmit_frame(fA->buf, fA->frame_size, 0, 0, "ADC0") == USBD_OK) {
                static uint8_t first_a_logged = 0;
                if(!first_a_logged){ first_a_logged = 1; VND_LOG("FIRST_A queued size=%u", (unsigned)fA->frame_size); }
                fA->st = FB_SENDING; sending_channel = 0;
                /* В режиме A-only не ожидаем B, иначе помечаем ожидание B */
                if(vnd_ch_mode == 0){
                    pending_B = 0;
                } else {
                    pending_B = 1; pending_B_since_ms = HAL_GetTick();
                }
                return;
            } else {
                /* ДИАГНОСТИКА: почему не удалось отправить A */
                static uint32_t last_tx_fail_log = 0;
                if((now - last_tx_fail_log) > 500){
                    last_tx_fail_log = now;
                    extern uint8_t USBD_VND_TxIsBusy(void);
                    cdc_logf("FAIL_TX_A ep_busy=%u ll_busy=%u inflight=%u ready=%u",
                        (unsigned)vnd_ep_busy, (unsigned)USBD_VND_TxIsBusy(), (unsigned)vnd_inflight, (unsigned)vnd_tx_ready);
                }
            }
#else
            /* Отправляем A только если нет теста в полёте и нет необработанного TEST в FIFO */
            if(!test_in_flight){
                if (vnd_transmit_frame(fA->buf, fA->frame_size, 0, 0, "ADC0") == USBD_OK) {
                    static uint8_t first_a_logged = 0;
                    if(!first_a_logged){ first_a_logged = 1; VND_LOG("FIRST_A queued size=%u", (unsigned)fA->frame_size); }
                    fA->st = FB_SENDING; sending_channel = 0;
                    /* Ранний запрет STAT между A и B: сразу помечаем ожидание B */
                    pending_B = 1; pending_B_since_ms = HAL_GetTick();
                    return;
                }
            }
#endif
        }
    }
    if(vnd_tick_flag) vnd_tick_flag = 0;
    if(cur_samples_per_frame == 0 && start_cmd_ms && (now - start_cmd_ms) > VND_DMA_TIMEOUT_MS && !no_dma_status_sent){
        adc_stream_debug_t dbg; adc_stream_get_debug(&dbg);
        if(dbg.dma_full0 == dma_snapshot_full0 && dbg.dma_full1 == dma_snapshot_full1){ no_dma_status_sent = 1; if(vnd_last_error == 0) vnd_last_error = 1; VND_LOG("ERR DMA_TIMEOUT"); }
    }
    /* Периодическая CDC-статистика по байтам/скорости */
    vnd_cdc_periodic_stats(now);
    
