kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    vnd_last_txcplt_ms = now_txcplt;
    /* Убран подробный лог TXCPLT — используется агрегированная статистика раз в 10 сек */
    vnd_total_tx_bytes += vnd_last_tx_len; /* учитывать и тестовые, и статусные, и рабочие */
    /* Зафиксировать завершение стартового ACK (если был) */
    if(start_stat_inflight){ start_stat_inflight = 0; start_ack_done = 1; }

    /* Надёжная классификация завершившегося буфера (приоритет inflight_* затем meta FIFO) */
    vnd_tx_meta_t meta; int have_meta = vnd_tx_meta_pop(&meta);
    uint8_t eff_is_frame = 0; uint8_t eff_flags = 0; uint32_t eff_seq = 0;
    if(inflight_is_frame){ eff_is_frame = 1; eff_flags = inflight_flags; eff_seq = inflight_seq; }
    else if(have_meta && meta.is_frame){ eff_is_frame = 1; eff_flags = meta.flags; eff_seq = meta.seq_field; }
    else if(have_meta){ eff_is_frame = 0; }
    else { eff_is_frame = last_tx_is_frame; eff_flags = last_tx_flags; eff_seq = last_tx_seq; }
    inflight_is_frame = 0; inflight_flags = 0; inflight_seq = 0;
    /* Убран подробный лог TXCPLT_CLASS — используется агрегированная статистика */

    /* Если это был ACK на STOP — после него переводим систему в остановленное состояние */
    if(stop_stat_inflight){
        stop_stat_inflight = 0;
        stop_request = 0;
        if(streaming){ streaming = 0; VND_LOG("STOP_STREAM after STAT"); }
        diag_mode_active = 0;
        vnd_reset_buffers();
        sending_channel = 0xFF; pending_B = 0; test_sent = 0; test_in_flight = 0; vnd_inflight = 0;
        /* Останавливаем DMA и сбрасываем буферы */
        extern void adc_stream_stop(void);
        adc_stream_stop();
        /* Индикация STOP: погасить пин Data_ready и вывести CDC-событие */
        HAL_GPIO_WritePin(Data_ready_GPIO22_GPIO_Port, Data_ready_GPIO22_Pin, GPIO_PIN_RESET);
        {
            uint64_t cur = vnd_total_tx_bytes;
            uint64_t delta = (cur >= vnd_tx_bytes_at_start) ? (cur - vnd_tx_bytes_at_start) : 0ULL;
            cdc_logf("EVT STOP total=%llu delta=%llu", (unsigned long long)cur, (unsigned long long)delta);
        }
        vnd_tx_kick = 1; /* пнуть таск на всякий случай */
        return;
    }
    if(test_in_flight)
    {
        test_in_flight = 0;
        test_sent = 1; /* помечаем тест выполненным ровно один раз, не сбрасывать вне START */
        first_test_sent_ms = HAL_GetTick();
        VND_LOG("TEST_TXCPLT");
        return;
    }
    if(!streaming){ vnd_tx_kick = 1; return; }

    /* Первая успешная рабочая передача (A или B): зафиксировать метку, если ещё не установлена */
    if(vnd_stage_first_frame_ms == 0 && eff_is_frame && (eff_flags == 0x01 || eff_flags == 0x02)){
        vnd_stage_first_frame_ms = HAL_GetTick();
    }
    /* НЕМЕДЛЕННАЯ ПОПЫТКА ОТПРАВКИ: если есть данные и EP свободен — отправить сразу.
       Это обеспечивает максимальную скорость USB без ожидания periodic task. */
    /* Критично: этот "fast kick" разрешён ТОЛЬКО для async режима в stream_mode=0 (LATEST).
       В LOSSLESS_ROI/AVG_ROI async-путь обходит строгую парность и/или AVG очередь. */
    if(streaming && !vnd_ep_busy && async_mode && full_mode && !diag_mode_active && (vnd_stream_mode == VND_STREAM_MODE_LATEST)){
        (void)vnd_async_try_tx();
    }
    
    /* Асинхронный режим: считаем канал по eff_flags, закрываем соответствующий подкадр.
       В A-only/B-only режиме закрываем сразу всю пару и сдвигаем seq. */
    if(async_mode && streaming && full_mode){
        if(eff_is_frame && (eff_flags == 0x01 || eff_flags == 0x02)){
            int ch = (eff_flags == 0x01) ? 0 : 1;
            if(vnd_pending_init){ vnd_pending_init = 0; }
            vnd_stream_active = 1;
            /* Учёт статистики по каналам (оценка сэмплов по текущему размеру кадра) */
            /* Статистика: если размер ещё не зафиксирован, используем активный профиль с учётом ограничений */
            uint16_t ns = cur_samples_per_frame;
            if(ns == 0){
                uint16_t eff = adc_stream_get_active_samples();
                if(eff == 0) eff = 1;
                if(vnd_frame_samples_req && vnd_frame_samples_req < eff) eff = vnd_frame_samples_req;
                if(vnd_trunc_samples && vnd_trunc_samples < eff) eff = vnd_trunc_samples;
                if(eff > VND_MAX_SAMPLES) eff = VND_MAX_SAMPLES;
                ns = eff;
            }
            if(ch==0){ dbg_tx_sent++; dbg_sent_ch0_total++; dbg_sent_seq_adc0++; vnd_total_tx_samples += (uint64_t)ns; fps_frame_a_count++; }
            else      { dbg_tx_sent++; dbg_sent_ch1_total++; dbg_sent_seq_adc1++; vnd_total_tx_samples += (uint64_t)ns; fps_frame_b_count++; }
            /* Отпускаем канал */
            sending_channel = 0xFF;
            if(vnd_stage_first_frame_ms == 0){ vnd_stage_first_frame_ms = HAL_GetTick(); cdc_logf("EVT FIRST_FRAME ch=%c", ch==0?'A':'B'); }
        }
        return;
    }

    /* Диагностический режим: используем eff_flags для точной классификации (устраняет гонку по sending_channel) */
    if(diag_mode_active){
        if(!eff_is_frame){
            /* STAT/ZLP — просто продолжим */
            vnd_tx_kick = 1; return;
        }
        if(eff_flags == 0x01){
            /* Завершился A: считаем и просим отправить B */
            dbg_tx_sent++; dbg_sent_ch0_total++; dbg_sent_seq_adc0++;
            /* В DIAG считаем семплы по текущему размеру кадра */
            vnd_total_tx_samples += (uint64_t)((cur_samples_per_frame != 0) ? cur_samples_per_frame : diag_samples);
            sending_channel = 0; /* завершили A */
            pending_B = 1; pending_B_since_ms = HAL_GetTick();
            /* Зафиксируем seq этой пары для B */
            diag_current_pair_seq = eff_seq;
            /* Немедленно пытаемся отправить B, чтобы убрать паузу между A и B */
            if(!vnd_try_send_B_immediate()){
                /* печать в CDC отключена для максимальной скорости */
                vnd_tx_kick = 1; return;
            } else {
                /* B пошёл в полёт — дальше обычная обработка после его завершения */
                return;
            }
        } else if(eff_flags == 0x02){
            /* Завершился B: закрываем пару, двигаем seq */
            dbg_tx_sent++; dbg_sent_ch1_total++; dbg_sent_seq_adc1++;
            vnd_total_tx_samples += (uint64_t)((cur_samples_per_frame != 0) ? cur_samples_per_frame : diag_samples);
            stream_seq++; dbg_produced_seq++;
            pending_B = 0; pending_B_since_ms = 0; sending_channel = 0xFF;
            diag_prepared_seq = 0xFFFFFFFFu; /* заставим подготовить новую пару */
            if(!first_pair_done){ first_pair_done = 1; }
            /* Сразу пытаемся отправить следующий A новой пары */
            if(!vnd_try_send_A_nextpair_immediate()){
                /* печать в CDC отключена для максимальной скорости */
                vnd_tx_kick = 1; return;
            } else {
                return;
            }
        } else if(eff_flags == 0x80){
            /* TEST */
            sending_channel = 0xFF;
            vnd_tx_kick = 1; return;
        } else {
            /* неизвестный флаг — игнорируем */
            vnd_tx_kick = 1; return;
        }
    }

