kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
                /* Печать в UART (COM4) — чтобы однозначно видеть применённый режим/avg_n */
                printf("[CMD_IND] SET_STREAM_MODE m=%u len=%u avg_n=%u\r\n", (unsigned)vnd_stream_mode, (unsigned)len, (unsigned)vnd_avg_n);

                /* LOSSLESS_ROI требует строгих A->B пар, поэтому принудительно выключаем async.
                   Это делает переключение режима самодостаточным (GUI не обязан слать SET_ASYNC_MODE). */
                if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
                    async_mode = 0;
                    async_mode_host_set = 1;
                }

                /* При смене режима сбрасываем lock размера кадра, чтобы избежать рассинхронизации формата. */
                cur_samples_per_frame = 0;
                cur_expected_frame_size = 0;

                /* Для требуемого режима "lossless ROI" выставляем дефолтное окно 280..480 (200).
                   Хост всё равно может переопределить через SET_WINDOWS. */
                if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
                    win_start0 = 280u; win_len0 = 200u;
                    win_start1 = 0u;   win_len1 = 0u;
                }
                vnd_update_lcd_params();
            }
            break;

        case VND_CMD_SET_DC_ADAPT:
            /* Управление адаптацией DC: 0x00=заморозить, 0x01=включить
               При детекции сигнала на RPI можно заморозить обучение DC,
               оставив вычитание текущих значений. */
            if(len >= 2)
            {
                uint8_t enable = data[1];
                vnd_dc_adapt_enabled = (enable != 0) ? 1 : 0;
                printf("[CMD_IND] SET_DC_ADAPT %s\r\n", vnd_dc_adapt_enabled ? "ACTIVE" : "FREEZE");
                cdc_logf("EVT SET_DC_ADAPT %u", (unsigned)vnd_dc_adapt_enabled);
            }
            break;

        case VND_CMD_SET_BLOCK_HZ:
            if(len >= 3)
            {
                uint16_t hz = (uint16_t)(data[1] | (data[2] << 8));
                if(hz == 0xFFFF) hz = 100;
                if(hz < 20) hz = 20;
                if(hz > 400) hz = 400;
                diag_hz = hz;
                diag_period_ms = 1000 / diag_hz;
                VND_LOG("SET_BLOCK_HZ %u", diag_hz);
                cdc_logf("EVT SET_BLOCK_HZ %u", (unsigned)diag_hz);
                /* NEW: авто-подбор профиля под желаемую частоту блоков, если мы в полном режиме (full_mode) */
                if(full_mode){
                    /* Целевые buf_rate_hz профилей: 200(A), 300(B/C/D), 400(E) */
                    uint16_t target = hz; /* запрос хоста: кадров в секунду */
                    uint8_t new_prof = adc_stream_get_profile();
                    if(target >= 380){ new_prof = ADC_PROFILE_E_400HZ; }
                    else if(target >= 250){ new_prof = ADC_PROFILE_B_DEFAULT; }
                    else { new_prof = ADC_PROFILE_A_200HZ; }
                    if(new_prof != adc_stream_get_profile()){
                        int rc = adc_stream_set_profile(new_prof);
                        VND_LOG("AUTO_PROFILE_BY_BLOCK_HZ hz=%u -> prof=%u rc=%d", target, new_prof, rc);
                        if(rc == 0){
                            uint16_t cur_samples = adc_stream_get_active_samples();
                            uint16_t cur_rate = adc_stream_get_buf_rate();
                            cdc_logf("EVT AUTO_PROFILE hz=%u prof=%u samples=%u rate=%u", (unsigned)target, (unsigned)new_prof, (unsigned)cur_samples, (unsigned)cur_rate);
                            /* Сброс lock размера, чтобы новые параметры применились */
                            cur_samples_per_frame = 0; cur_expected_frame_size = 0;
                        }
                    }
                }
                vnd_update_lcd_params();
            }
            break;
        case VND_CMD_SET_ASYNC_MODE:
            if(len >= 2){
                uint8_t mode = data[1];
#if USE_TEST_SAWTOOTH
                /* Игнорируем запросы async в тестовом режиме — нужен парный путь */
                async_mode = 0; vnd_strict_pairing = 0;
                cdc_logf("EVT SET_ASYNC ignored (test mode)");
#else
                async_mode = (mode & 0x01) ? 1 : 0;
                async_mode_host_set = 1;
                /* bit7 включает строгую парность (A&B на один seq); по умолчанию 0 = независимые каналы */
                vnd_strict_pairing = (mode & 0x80) ? 1 : 0;
                /* Режимы LOSSLESS_ROI/AVG_ROI требуют строгой A->B парности: не позволяем включить async. */
                if((vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI) && async_mode){
                    async_mode = 0;
                }
                /* Запретить async при одноканальном режиме (A-only/B-only) для стабильности */
                if(vnd_ch_mode != 2 && async_mode){ async_mode = 0; }
                VND_LOG("SET_ASYNC_MODE async=%u strict_pair=%u", (unsigned)async_mode, (unsigned)vnd_strict_pairing);
                cdc_logf("EVT SET_ASYNC async=%u strict=%u", (unsigned)async_mode, (unsigned)vnd_strict_pairing);
                /* Сбросим ожидания и канал передачи */
                pending_B = 0; sending_channel = 0xFF;
#endif
            }
            break;
        case VND_CMD_SET_CHMODE:
            if(len >= 2){
                uint8_t m = data[1];
#if USE_TEST_SAWTOOTH
                /* В тестовом режиме принудительно оба канала */
                vnd_ch_mode = 2; async_mode = 0;
                cdc_logf("EVT SET_CHMODE forced BOTH (test mode)");
#else
                if(m > 2) m = 2; /* default both */
                vnd_ch_mode = m;
                /* При A-only/B-only принудительно выключаем async */
                if(vnd_ch_mode != 2 && async_mode){ async_mode = 0; }
                VND_LOG("SET_CHMODE %u", (unsigned)vnd_ch_mode);
                cdc_logf("EVT SET_CHMODE %u", (unsigned)vnd_ch_mode);
#endif
                /* Переключение режимов на лету: сброс ожиданий B, чтобы не зависать */
                pending_B = 0; sending_channel = 0xFF;
            }
            break;
        case VND_CMD_SET_FULL_MODE:
            if(len >= 2)
            {
                uint8_t full = data[1] ? 1 : 0;
                full_mode = full;
                VND_LOG("SET_FULL_MODE %u", full_mode);
                cdc_logf("EVT SET_FULL_MODE %u", (unsigned)full_mode);
                if(streaming){
                    /* Переключение режима на лету: сброс пары и разрешение TEST не требуется */
                    pending_B = 0; sending_channel = 0xFF;
                }
                if(full_mode){
                    /* Возврат к нормальному режиму ADC */
                    diag_mode_active = 0; diag_prepared_seq = 0xFFFFFFFFu;
                    /* При входе в полный режим – использовать фактический размер профиля ADC, снять lock и пересчитать период */
                    vnd_frame_samples_req = 0; /* 0 = использовать g_active_samples из профиля */
                    cur_samples_per_frame = 0;
                    cur_expected_frame_size = 0;
                    vnd_recompute_pair_timing(vnd_frame_samples_req);
                } else {
                    /* Включаем диагностический режим (пила) */
                    diag_mode_active = 1;
                    diag_samples = (cur_samples_per_frame != 0) ? cur_samples_per_frame : VND_DEFAULT_TEST_SAMPLES;
                    if(diag_samples > VND_MAX_SAMPLES) diag_samples = VND_MAX_SAMPLES;
                    cur_samples_per_frame = diag_samples;
                    cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + cur_samples_per_frame*2u);
                    /* Разрешаем немедленную отправку диагностических кадров */
                    diag_next_ms = HAL_GetTick(); diag_prepared_seq = 0xFFFFFFFFu;
                }
                vnd_update_lcd_params();
            }
            break;
        case VND_CMD_SET_TRUNC_SAMPLES:
            if(len >= 3){
                uint16_t ns = (uint16_t)(data[1] | (data[2] << 8));
                vnd_trunc_samples = ns;
                VND_LOG("SET_TRUNC_SAMPLES %u", (unsigned)vnd_trunc_samples);
                cdc_logf("EVT SET_TRUNC %u", (unsigned)vnd_trunc_samples);
                /* Сбросим текущий lock размера, чтобы статус отразил новые размеры, применится при следующем кадре */
                cur_samples_per_frame = 0;
                cur_expected_frame_size = 0;
            }
            break;
        case VND_CMD_SET_PROFILE:
            if(len >= 2)
            {
                uint8_t profile = data[1];
                uint8_t prof_id = ADC_PROFILE_B_DEFAULT;
                // Маппинг host profile -> firmware profile ID:
                // 0 -> ADC_PROFILE_A_200HZ (1360 samples @ 200Hz)
                // 1 -> ADC_PROFILE_B_DEFAULT (912 samples @ 300Hz)
                // 2 -> ADC_PROFILE_C_HIGH (944 samples @ 300Hz)
                // 3 -> ADC_PROFILE_D_MAX (976 samples @ 300Hz)
                // 4 -> ADC_PROFILE_E_400HZ (680 samples @ 400Hz HIGH-FPS)
                if(profile == 0) prof_id = ADC_PROFILE_A_200HZ;
                else if(profile == 1) prof_id = ADC_PROFILE_B_DEFAULT;
                else if(profile == 2) prof_id = ADC_PROFILE_C_HIGH;
                else if(profile == 3) prof_id = ADC_PROFILE_D_MAX;
                else if(profile == 4) prof_id = ADC_PROFILE_E_400HZ;
                int rc = adc_stream_set_profile(prof_id);
                VND_LOG("SET_PROFILE %u -> prof_id=%u rc=%d", profile, prof_id, rc);
                /* ДИАГНОСТИКА: вывести текущее состояние после смены профиля */
                if(rc == 0) {
                    host_profile = profile; /* запомним для LCD ровно то, что прислал хост */
                    uint16_t cur_samples = adc_stream_get_active_samples();
                    uint16_t cur_rate = adc_stream_get_buf_rate();
                    cdc_logf("EVT SET_PROFILE p=%u samples=%u rate=%u Hz", profile, cur_samples, cur_rate);
                    vnd_update_lcd_params();
                }
            }
            break;
        case VND_CMD_SET_ROI_US:
            if(len >= 5)
            {
                uint32_t us = (uint32_t)(data[1] | (data[2] << 8) | (data[3] << 16) | (data[4] << 24));
                (void)us;
                /* TODO: применить ROI к цепочке выборки */
                VND_LOG("SET_ROI_US %lu", (unsigned long)us);
            }
            break;
        case VND_CMD_SET_BUF_RATE_FINE:
            if(len >= 3)
            {
                uint16_t buf_rate_hz = (uint16_t)(data[1] | (data[2] << 8));
                adc_stream_set_buf_rate_fine(buf_rate_hz);
                VND_LOG("CMD_IND SET_BUF_RATE_FINE %u Hz OK", (unsigned)buf_rate_hz);
                cdc_logf("CMD_IND SET_BUF_RATE_FINE %u Hz OK", (unsigned)buf_rate_hz);
            }
            break;
        default:
            VND_LOG("IGN %02X", cmd);
            break;
    }
}

/* Duplicate vnd_diag_send64_once removed */
uint32_t vnd_get_last_txcplt_ms(void)
{
    return vnd_last_txcplt_ms;
}

/* Общее число переданных байт (все передачи) */
uint64_t vnd_get_total_tx_bytes(void)
{
    return vnd_total_tx_bytes;
}

/* Общее число переданных сэмплов (оба канала суммарно) */
uint64_t vnd_get_total_tx_samples(void)
{
    return vnd_total_tx_samples;
}

