kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* Общая диагностическая функция: при обращении хоста за статусом проверяет признаки паузы
   и печатает STALL_WARN не чаще чем раз в 2 секунды. Вызывается как из bulk-пути, так и из EP0. */
/* Беззнаковая разность тиков (обработка переполнения 32-бит HAL_GetTick()). */
static inline uint32_t tick_diff32(uint32_t now, uint32_t before){
    return (now >= before) ? (now - before) : (0xFFFFFFFFu - before + 1u + now);
}

void vnd_diag_log_possible_stall(void)
{
    static uint32_t last_stall_warn_ms = 0;
    if(!streaming) return;
    uint32_t now_ms = HAL_GetTick();
    uint32_t dt = tick_diff32(now_ms, vnd_last_txcplt_ms);
    if(dt <= 600 || dt >= 3000) return;
    if(last_stall_warn_ms != 0 && (now_ms - last_stall_warn_ms) <= 2000) return;
    extern uint8_t USBD_VND_TxIsBusy(void);
    uint8_t ll_busy = USBD_VND_TxIsBusy();
    const char *stA = (g_frames[0][0].st==FB_READY?"READY":(g_frames[0][0].st==FB_SENDING?"SENDING":"FILL"));
    const char *stB = (g_frames[0][1].st==FB_READY?"READY":(g_frames[0][1].st==FB_SENDING?"SENDING":"FILL"));
    adc_stream_debug_t dbg; adc_stream_get_debug(&dbg);
    const char *stall_class = "UNKNOWN";
    uint8_t have_meta = (vnd_tx_meta_depth() > 0);
    uint32_t wr = frame_wr_seq, rd = frame_rd_seq;
    if(!have_meta && !pending_B && !ll_busy && !vnd_ep_busy){
        stall_class = "ADC_IDLE";
    } else if((vnd_ep_busy || ll_busy) && vnd_inflight){
        stall_class = "USB_BUSY";
    } else if(pending_B){
        if(g_frames[0][1].st!=FB_READY && g_frames[0][1].st!=FB_SENDING){ stall_class = "WAIT_B_FILL"; }
        else if(g_frames[0][1].st==FB_READY && !vnd_ep_busy){ stall_class = "B_READY_NOT_TX"; }
        else if(g_frames[0][1].st==FB_SENDING && (now_ms - vnd_last_tx_start_ms) > 120){ stall_class = "B_INFLIGHT_LONG"; }
        else stall_class = "PEND_B";
    } else if(!pending_B && g_frames[0][0].st==FB_READY && !vnd_ep_busy){
        stall_class = "A_READY_NOT_TX";
    } else if(have_meta && !vnd_inflight && !vnd_ep_busy){
        stall_class = "META_WAIT";
    }
    static uint32_t last_wr_seq = 0; static uint32_t last_wr_ms = 0;
    if(wr != last_wr_seq){ last_wr_seq = wr; last_wr_ms = now_ms; }
    else if(tick_diff32(now_ms, last_wr_ms) > 300 && strcmp(stall_class,"ADC_IDLE")!=0){ stall_class = "ADC_STALL"; }
    cdc_logf("STALL_WARN class=%s dt=%lums ep_busy=%u ll_busy=%u inflight=%u pendB=%u ch=%u A=%s B=%s metaD=%u wr=%lu rd=%lu prod=%lu sentA=%lu sentB=%lu dmaF0=%lu dmaF1=%lu",
        stall_class,
        (unsigned long)dt,
        (unsigned)vnd_ep_busy,
        (unsigned)ll_busy,
        (unsigned)vnd_inflight,
        (unsigned)pending_B,
        (unsigned)sending_channel,
        stA, stB,
        (unsigned)vnd_tx_meta_depth(),
        (unsigned long)wr,
        (unsigned long)rd,
        (unsigned long)dbg_produced_seq,
        (unsigned long)dbg_sent_ch0_total,
        (unsigned long)dbg_sent_ch1_total,
        (unsigned long)dbg.dma_full0,
        (unsigned long)dbg.dma_full1);
    VND_LOG("STALL_WARN class=%s dt=%lums ep_busy=%u ll_busy=%u pendB=%u A=%s B=%s metaD=%u wr=%lu rd=%lu",
        stall_class,
        (unsigned long)dt,
        (unsigned)vnd_ep_busy,
        (unsigned)ll_busy,
        (unsigned)pending_B,
        stA, stB,
        (unsigned)vnd_tx_meta_depth(),
        (unsigned long)wr,
        (unsigned long)rd);
    last_stall_warn_ms = now_ms;
}

/* Хук от цепочки ADC: когда появились новые кадры — пинаем таск */
void adc_stream_on_new_frames(uint32_t frames_added)
{
    (void)frames_added;
    /* минимальный kick: если не заняты и идёт стрим — дать шанс таску отправить */
    if(streaming){ vnd_tx_kick = 1; }
}

/* Получить текущие min/max АЦП значения из последних отправленных кадров */
void vnd_get_adc_minmax(int16_t *adc0_min, int16_t *adc0_max, 
                        int16_t *adc1_min, int16_t *adc1_max)
{
    static int16_t cached_adc0_min = 0;
    static int16_t cached_adc0_max = 0;
    static int16_t cached_adc1_min = 0;
    static int16_t cached_adc1_max = 0;
    static uint32_t cached_seq = 0;
    static uint32_t log_count = 0;
    
    if(!adc0_min || !adc0_max || !adc1_min || !adc1_max) {
        return;
    }
    
    /* Пытаемся найти последний готовый кадр для получения min/max */
    uint8_t idx = (pair_send_idx > 0) ? (pair_send_idx - 1) : (VND_PAIR_BUFFERS - 1);
    
    /* Логируем состояние буферов каждые 50 вызовов */
    if(log_count++ % 50 == 0) {
        printf("[VND_GET_MINMAX] idx=%u seq_cached=%lu seq_current=%lu st=%u samples0=%u samples1=%u\r\n",
               idx, cached_seq, g_frames[idx][0].seq, g_frames[idx][0].st,
               g_frames[idx][0].samples, g_frames[idx][1].samples);
    }
    
    /* Проверяем, был ли кадр уже обработан */
    if(g_frames[idx][0].seq != cached_seq && g_frames[idx][0].st != FB_FILL) {
        cached_seq = g_frames[idx][0].seq;
        printf("[VND_GET_MINMAX] Processing frame seq=%lu\r\n", cached_seq);
        
        /* Декодируем min/max из кадра ADC0 */
        const uint8_t *buf = g_frames[idx][0].buf;
        uint16_t samples = g_frames[idx][0].samples;
        
        if(samples > 0 && g_frames[idx][0].frame_size >= 32 + 2*samples) {
            const int16_t *data = (const int16_t *)(buf + 32);
            cached_adc0_min = data[0];
            cached_adc0_max = data[0];
            
            for(uint16_t i = 1; i < samples; i++) {
                if(data[i] < cached_adc0_min) cached_adc0_min = data[i];
                if(data[i] > cached_adc0_max) cached_adc0_max = data[i];
            }
        }
        
        /* Декодируем min/max из кадра ADC1 */
        buf = g_frames[idx][1].buf;
        samples = g_frames[idx][1].samples;
        
        if(samples > 0 && g_frames[idx][1].frame_size >= 32 + 2*samples) {
            const int16_t *data = (const int16_t *)(buf + 32);
            cached_adc1_min = data[0];
            cached_adc1_max = data[0];
            
            for(uint16_t i = 1; i < samples; i++) {
                if(data[i] < cached_adc1_min) cached_adc1_min = data[i];
                if(data[i] > cached_adc1_max) cached_adc1_max = data[i];
            }
        }
        
        printf("[VND_GET_MINMAX] Decoded: CH0=%d..%d CH1=%d..%d\r\n",
               cached_adc0_min, cached_adc0_max, cached_adc1_min, cached_adc1_max);
    }
    
    *adc0_min = cached_adc0_min;
    *adc0_max = cached_adc0_max;
    *adc1_min = cached_adc1_min;
    *adc1_max = cached_adc1_max;
}

/* EOF (clean version) */
